[" Kun poistut tietokoneeltasi, sinun tulisi lukita näyttö estääksesi toisia käyttämästä konettasi ja lukemasta tiedostojasi. Olet silti kirjautuneena ja ohjelmasi ovat yhä käynnissä, mutta sinun täytyy kirjoittaa salasanasi käyttääksesi konetta uudelleen. Voit lukita näytön manuaalisesti, mutta sen voi asettaa lukittumaan automaattisesti. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Kirkkaus ja lukitus. Varmista, että Automaattinen lukitus on käytössä ja valitse viime alla olevasta pudotusvalikosta. Näyttö lukittuu automaattisesti, jos kone on ollut käyttämättömänä asetetun viiveen verran. Voit myös valita Näyttö sammutetaan lukitaksesi näytön sen sammuttamisen jälkeen, jonka viivettä voit säätää Sammuta näyttö koneen ollessa käyttämättä -pudotusvalikolla.", " GNOME perustuu Argyll-värinhallintajärjestelmän tukemiin väreihin. Niinpä seuraavat näyttömittauslaitteet ovat tuettuja: Gretag-Macbeth i1 Pro (spektrometri) Gretag-Macbeth i1 Monitor (spektrometri) Gretag-Macbeth i1 Display 1, 2 tai LT (värimittari) X-Rite i1 Display Pro (värimittari) X-Rite ColorMunki Design tai Photo (spektrometri) X-Rite ColorMunki Create (kolorimetri) X-Rite ColorMunki Display (kolorimetri) Pantone Huey (kolorimetri) MonacoOPTIX (kolorimetri) ColorVision Spyder 2 ja 3 (kolorimetri) Colorimètre HCFR (kolorimetri) Pantone Huey on tällä hetkellä halvin ja parhaiten tuettu laite Linux-ympäristössä. Kiitos Argyllin on olemassa myös joukko tuettuja piste- ja raitalukuun tarkoitettuja heijastavia spektrometrejä. Näitä voidaan käyttää tulostimien kalibroinnissa ja karakterisoinnissa. X-Rite DTP20 \"Pulse\" (\"pyyhkäisy\"-tyyppinen reflektiivinen spektrometri) X-Rite DTP22 Digital Swatchbook (pistetyyppinen reflektiivinen spektrometri) X-Rite DTP41 (piste- ja raitalukuun kykenevä reflektiivinen spektrometri) X-Rite DTP41T (piste- ja raitalukuun kykenevä reflektiivinen spektrometri) X-Rite DTP51 (pistelukuun kykenevä reflektiivinen spektrometri)", " Useimmat hiiret ja kosketyslevyt sisältävät keskimmäisen painikkeen. Vieritysrullalla varustetuissa hiirissä on yleensä mahdollista painaa vieritysrulla pohjaan, jolloin painallus luetaan keskimmäisen painikkeen napsautukseksi. Jos hiiressäsi ei ole vieritysrullaa, voit painaa vasemman ja oikean painikkeen pohjaan samanaikaisesti napsauttaaksesi keskimmäistä painiketta. Jos et voi tehdä tätä, seuraa näitä ohjeita. Monikosketusta tukevilla kosketuslevyillä keskipainikkeen painalluksen voi tehdä napsauttamalla levyä kolmella sormella. Kosketuslevyn hiirinapsautukset pitää kuitenkin ottaa käyttöön toiminnon käyttämiseksi. Monet sovellukset hyödyntävät hiiren keskipainiketta. Yksi toiminnoista on tekstin liittäminen leikepöydältä. Maalaa teksti, napsauta aluetta johon sen haluat liittää ja paina keskipainiketta. Valittu teksti liitettiin osoittimen kohtaan. Tekstin liittäminen keskipainikkeella on erillinen toiminto normaalista leikepöydästä. Tekstin kopioiminen ja liittäminen tällä tavalla ei kopioi tekstiä leikepöydälle. Keskipainikkeen painaminen ja Ctrl+C ja V ovat siis kaksi erillistä toimintoa. Vierityspalkkien ja liukusäätimien tyhjän tilan napsauttaminen hiiren vasemmalla painikkeella vierittää palkkia aina tietyn verran (kuten yhden sivun) napsauttamaasi suuntaan. Hiiren keskinäppäimen painallus sen sijaan siirtää liukusäätimen tai vierityspalkin juuri napsautuksen kohdalle. Voit avata nopeasti uuden ikkunan sovelluksesta hiiren keskimmäisellä painikkeella. Napsauta haluamasi sovelluksen kuvaketta hiiren keskimmäisellä painikkeella käynnistimessä tai Unity-valikossa. Useimmat verkkoselaimet avaavat linkin uuteen välilehteen napsauttaessa sitä keskipainikkeella. Tiedostonhallinnassa keskipainikkeella on kaksi tehtävää. Kansiota napsauttaessa kansio aukeaa uuteen välilehteen. Mitä tahansa tiedostoa napsauttaessa keskipainikkeen painallus vastaa normaalia tiedoston avaamista, eli kaksoispainallusta. Tiedoston napsautus keskipainikkeella siis avaa sen. Joillakin muilla sovelluksilla voi olla vielä lisäksi omia toimintojaan keskipainikkeelle sovelluskohtaisesti. Lisätietoja saat sovelluksen ohjeesta.", " Jos et halua enää jatkossa yhdistää tiettyyn Bluetooth-laitteeseen, voit poistaa yhteyden. Tämä on hyödyllistä silloin, kun et aio enää käyttää tiettyä hiirtä tai kuulokemikrofonia, tai jos et halua enää siirtää tiedostoja tietyn laitteen kanssa. Napsauta Bluetooth-kuvaketta valikkopalkista ja valitse Bluetooth-asetukset... Valitse vasemmanpuoleisesta paneelista laite, jonka haluat irrottaa, ja napsauta sitten listan alta -. Napsauta Poista varmennusikkunassa. Voit yhdistää Bluetooth-laitteeseen uudelleen myöhemmin niin halutessasi.", " Alla on lista sijainneista, jossa tärkeät tiedostot ja asetukset normaalisti sijaitsevat. Henkilökohtaiset tiedostot (asiakirjat, musiikki, valokuvat ja videot) Nämä sijaitsevat yleensä kotikansiossasi (/home/käyttäjätilisi). Tiedostot saattavat sijaita alikansioissa kuten Työpöytä, Asiakirjat, Kuvat, Musiikki ja Videot. Jos varmuuskopion tallennuskohteessa on tarpeeksi tilaa (jos se on esimerkiksi ulkoinen kiintolevy), koko kotikansion kopioimista kannattaa harkita. Kotikansion koon saat selville Levynkäytön analysointi-ohjelmalla. Piilotiedostot Kaikki pisteellä alkavat tiedostot ja kansiot ovat oletuksena piilotiedostoja ja -kansioita. Piilotiedostojen selaaminen onnistuu valitsemalla Näytä ▸ Näytä piilotiedostot tai käyttämällä Ctrl+H -näppäinyhdistelmää. Henkilökohtaiset asetukset (työpöytäasetukset, teemat ja sovellusten asetukset) Useimmat sovellukset tallentavat asetuksensa kotikansiossasi oleviin piilokansioihin. Lue lisää piilotiedostoista ylempää. Suurin osa sovellusten asetuksista tallennetaan kotikansiossa oleviin piilokansioihin .config, .gconf, .gnome2 ja .local. Järjestelmänlaajuiset asetukset Järjestelmän tärkeiden osien asetuksia ei säilytetä kotikansiossasi. Järjestelmäasetuksia voidaan säilyttää useassa eri hakemistossa mutta suurin osa löytyy /etc-hakemiston alta. Kotikäytössä olevan koneen järjestelmäasetuksia ei yleensä tarvitse varmuuskopioida. Jos kuitenkin ylläpidät palvelinta, sillä pyörivien palvelujen tiedostot kannattaa pitää tallessa.", " Jos sinulla on uusi iPod jota ei ole aikaisemmin kytketty mihinkään tietokoneeseen, sitä ei tunnisteta oikein liittäessäsi sen Linux-tietokoneeseen. Tämä johtuu siitä, että iPodit pitää aktivoida ja päivittää iTunes-ohjelmistolla, joka on saatavilla vain Windowsille ja Macille. Aktivoi iPodisi asentamalla ensin iTunes Windowsiin tai Mac-tietokoneeseen ja liitä iPod tietokoneeseen. Noudata iTunesin ohjeita aktivoimisessa. Kun aktivointiohjelma kysyy Alustusmuotoa, valitse MS-DOS (FAT), Windows tai jokin muu vastaava. Muut muodot (HFS/Mac) eivät toimi kunnolla Linuxissa. Kun aktivointi on suoritettu, iPod toimii normaalisti kytkiessäsi sen Linux-tietokoneeseen.", " Kun käytät ulkoisia tallennusvälineitä, kuten USB-muistitikkuja, sinun kannattaisi poistaa ne turvallisesti järjestelmästä ennen niiden irrottamista. Jos vain irrotat laitteen ja joku ohjelma käyttää sitä yhä, tiedostoja voi kadota tai vaurioitua. Kun käytät optista levyä kuten CD:tä tai DVD:tä, voit käyttää samoja ohjeita levyn poistamiseen tietokoneesta. Avaa tiedostonhallinta. Paikallista laite sivupaneelista. Laitteen nimen vieressä pitäisi olla pieni irrotuskuvake. Napsauta kyseistä kuvaketta poistaaksesi laitteen turvallisesti. Vaihtoehtoisesti, napsauta laitteen nimeä sivupalkissa hiiren oikealla painikkeella ja valitse Irrota. Jos yksikään ohjelma käyttää laitteen tiedostoja, et pysty sammuttamaan laitetta turvallisesti. Sinulle ilmoitetaan, että ”laite on käytössä” ja kaikki laitteen käytössä olevat tiedostot listataan. Kun olet sulkenut kaikki laitteen tiedostot, laite poistetaan automaattisesti turvallisesti (jotta voit irrottaa sen). Jos et pysty sulkemaan yhtä tiedostoa (esimerkiksi jos tiedostoa käyttävä ohjelma on lukittautunut), voit painaa hiiren oikeaa nappia Asema on kiireinen -ikkunassa ja valita Lopeta prosessi. Tämä pakottaa ohjelman sulkeutumaan ja sulkee kaikki ohjelman avoimet tiedostot. You can also choose Eject Anyway to\n  remove the device without closing the files. This may cause errors in\n  applications that have those files open.", " Voit simuloida hiiren oikean painikkeen painallusta pitämällä hiiren vasenta painiketta pohjassa hetken. Tämä on hyödyllistä, jos sinun on vaikea liikuttaa tiettyjä sormia tai jos hiiressäsi on vain yksi painike. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Esteettömyys ja valitse Osoittaminen ja napsauttaminen -välilehti. Kytke päälle Kakkospainikkeen simuloitu painallus. Voit muuttaa oikean painikkeen painalluksen simuloinnin viivettä Kohdistaminen ja napsauttaminen -välilehdeltä säätämällä Viiveen kesto -liukusäädintä Kakkospainikkeen simuloitu napsautus -otsakkeen alla. Hiiren oikean painikkeen painalluksen simulointi onnistuu painamalla hiiren vasen painike pohjaan kohdassa, jossa haluat oikean painikkeen painalluksen tapahtuvan. Osoitin täyttyy sinisellä värillä painaessasi hiiren vasenta painiketta. Kun osoitin on täysin värin peitossa, vapauta vasen painike ja oikean painikkeen painallus simuloidaan. Joidenkin erikoisosoittimien, kuten koonmuutososoittimen, tapauksessa osoittimen väri ei vaihdu. Kakkospainikkeen simuloitu napsautus toimii kuitenkin normaalilla tavalla vaikka osoittimen väri ei muutu. Jos käytät hiirinäppäimiä, hiiren oikean painikkeen painallus onnistuu pitämällä hetken pohjassa numeronäppäintä 5.", " Jotkut verkkotilit tarjoavat useita palveluja samalla tilillä. Esimerkiksi Google-tilillä voi käyttää muun muassa sähköpostia, kalenteria ja yhteystietoja. Poistaaksesi ominaisuuksia käytöstä: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Verkkotilit. Valitse muutettava tili ikkunan vasemmasta reunasta. Palvelun tukemat ominaisuudet näkyvät ikkunan oikeassa reunassa. Poista tarpeettomat ominaisuudet käytöstä. Kun ominaisuus poistetaan käytöstä, sovelluksilla ei ole enää oikeutta käyttää sitä. Oikeudet voi palauttaa palaamalla Verkkotileihin ja ottamalla ominaisuuden uudelleen käyttöön.", " Väriprofiilit jotka olet itse luonut ovat erityisesti laitteistolle ja valaistusolosuhteille, joille kalibroit ne. Näyttö joka on ollut kytkettynä muutaman sadan tunnin ajan omaa hyvin erilaisen väriprofiilin verrattuna samanlaiseen näyttöön, joka on ollut käytössä tuhat tuntia. Tämä merkitsee, että väriprofiilisi jakaminen jonkun toisen kanssa voi parantaa hänen kalibraatiotaan, mutta on parhaassakin tapauksessa väärin sanoa, että hänen näyttönsä on kalibroitu. Vastaavasti, ellei kaikilla ole samat suositellut valaistusolosuhteet (ei auringonpaistetta ikkunoista, mustat seinät, päivänvalolamput jne) huoneissaan kuvia katsottaessa ja muokattaessa, luodun profiilin jakaminen ei ole järkevää. Verkosta noudettujen tai sinulle luotujen profiilien edelleenjakoehdot on syytä tarkistaa huolellisesti.", " Avaa Järjestelmäasetukset ▸ Värit ja napsauta laitetta, jolle haluat lisätä profiilin. Napsauttamalla Lisää profiili voit valita jo olemassa olevan profiilin tai tuoda uuden tiedoston. Jokaiseen laitteeseen on mahdollista yhdistää monia profiileja, mutta vain yksi profiili voi olla oletusprofiili. Oletusprofiilia käytetään, jos muita profiileja ei ehdoteta automaattisesti käytettäväksi. Esimerkki automaattisesta valinnasta voisi olla, että yksi profiili on luotu kiiltävälle paperille ja toinen tavalliselle paperille. Jos kalibrointilaite on yhdistetty, Kalibroi... -painike luo uuden profiilin.", " Varmuuskopioinnilla tarkoitetaan yksinkertaisesti tiedostojen kopioimista turvaan. Näin varaudutaan ongelmiin, kuten alkuperäisen tiedoston katoamiseen tai rikkoutumiseen. Varmuuskopioita voidaan käyttää alkuperäisen tiedoston palauttamiseen, kun ongelmia on ilmennyt. Varmuuskopiot tulisi säilyttää eri laitteella kuin alkuperäiset tiedostot. Voit käyttää esimerkiksi USB-muistitikkua, ulkoista kiintolevyä, CD- tai DVD-levyä, verkkopalvelua tai näiden yhdistelmiä. Paras lopputulos saavutetaan hoitamalla varmuuskopiointi säännöllisesti maantieteellisesti useaan eri kohteeseen salattuna.", " Kun asennat Ubuntun, valitsemasi kieli sekä englanninkieli asentuvat. Voit halutessasi lisätä käytössä olevaa kielivalikoimaa. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Kieliasetukset Henkilökohtaiset-osiosta. Napsauta Asenna tai poista kieliä.... Asennetut kielet -ikkuna listaa kaikki saatavilla olevat kielet. Asennettujen kielien kohdalla on \"Asennettu\"-valinta. Valitse kielet, jotka haluat asentaa. Jos haluat poistaa jo asennetun kielen, poista valinta kyseisen kielen kohdalta. Napsauta Toteuta muutokset. Tarvitset ylläpitäjän oikeudet. Anna salasanasi tai pyydetyn ylläpitotilin salasana. Käyttöliittymän viestien käännösten lisäksi uuden kielen asennus saattaa asentaa lisäosia, kuten sanastoja, kirjasimia ja syötemenetelmiä. Käännökset voivat kielestä riippuen olla puuttellisia ja sisältää virheitä, eivätkä kaikki sovellukset välttämättä tue lainkaan käyttämääsi kieltä. Suomen kielelle on Ubuntussa verrattain hyvä tuki, mutta sovelluksissa sen yleisyys vaihtelee.", " Kun asetat tietokoneen lepotilaan, kaikki avoinna olevat sovellukset ja asiakirjat pysyvät avoinna. Tietokone sammuu kokonaan, eikä se käytä lainkaan virtaa. Lepotila vastaa tietokoneen sammuttamista sillä erolla, että kone käynnistyy nopeammin ja sovellukset sekä asiakirjat pysyvät avoinna. Valitettavasti lepotila ei toimi kaikkien tietokoneiden kanssa, ja siitä johtuen avoinna olevissa asiakirjoissa ja sovelluksissa olevat tiedot saattavat kadota lepotilassa. Tietojen katoamisen estämiseksi lepotila on oletuksena pois käytöstä. Tallenna kaikki työsi varmuuden varalta, ennen kuin asetat tietokoneen valmius- tai lepotilaan. Näin työsi säilyvät, vaikka tietokone ei syystä tai toisesta käynnistyisi oikein. Lepotilan toimintaa voi testata komentorivin kautta. Avaa Pääte painamalla Ctrl+Alt+t tai etsimällä hakusanalla pääte Unity-valikossa. Kirjoita sudo pm-hibernate päätteeseen ja paina Enter. Anna salasanasi, kun sitä kysytään. Kun kone on sammunut, käynnistä se uudelleen. Avautuivatko päälle jätetyt ohjelmat? Jos lepotila ei toimi, tarkista, että swap-osio on ainakin yhtä suuri kuin RAM-muisti. Jos lepotilatesti toimii koneellasi, voit asettaa tietokoneesi lepotilaan jatkossa komennolla sudo pm-hibernate. Voit myös asettaa lepotilan näkymään valikossa. Avaa haluamasi tekstimuokkain ylläpitäjän oikeuksin ja luo tiedosto /etc/polkit-1/localauthority/50-local.d/com.ubuntu.enable-hibernate.pkla. Lisää kyseiseen tiedostoon alla olevat rivit, jonka jälkeen tallenna tiedosto.", " Joskus verkkoyhteys saattaa katkeilla. Ubuntu yrittää muodostaa yhteyden automaattisesti uudelleen verkkoon, johon yhteys on katkennut (verkkovalikossa kaaret alkavat \"juosta\" ylöspäin), mutta se voi olla ärsyttävää, varsinkin jos Internet-yhteyttä käytettiin katkeamishetkellä. Yleisin syy yhteyden katkeamiseen on heikko signaali. Langattomilla tukiasemilla on tietty kantomatka, ja jos olet sen ulkopuolella, signaali ei ole ehkä tarpeeksi vahva tiedon siirtämisen. Seinät ja muut esteet tukiaseman ja tietokoneen välissä voivat heikentää signaalia merkittävästi. Verkkovalikon kuvake oikealla valikkopalkissa ilmaisee signaalin vahvuuden. Jos verkkopalkkeja on vähän, yritä siirtyä mahdollisuuksien mukaan lähemmäksi langatonta tukiasemaa. Joskus yhteys saattaa katketa välittömästi sen muodostamisen jälkeen. Tämä johtuu yleensä siitä, että yhteyden muodostus onnistui vain osittain; tietokone sai yhteyden verkkoon, mutta ei jostain syystä onnistunut viimeistelemään yhteyttä. Mahdollisia syitä tähän on muun muassa virheellinen salasana tai tietokonettasi ei ole ehkä sallittu käyttämään verkkoa. Tämä taas voi johtua esimerkiksi siitä, että verkko vaatii rekisteröitymisen. Verkkoihin kuuluu monta laitetta ja ajuria eri valmistajilta, joilla voi tulla ongelmia keskenään, jonka takia yhteydet voivat katkeilla ja olla hitaita. Tämä on ärsyttävää, mutta tapahtuu jos samaa verkkoa käyttää useampi laite. Jos yhteys katkeilee vähän väliä (yhteys muodostuu, katkeaa, muodostuu uudelleen...), tämä on todennäköisesti ongelman aiheuttaja. Jos tämä alkaa käydä mahdottomaksi, kannattaa harkita verkkolaitteiston, kuten WLAN-tukiaseman vaihtamista. Langattomia verkkoja vilkkaissa paikoissa (esimerkiksi kahviloissa, yliopistoissa ja lentokentillä) käyttää yleensä monta tietokonetta samaan aikaan. Joskus tällaiset verkot voivat ruuhkautua, eivätkä ne kykene enää tarjoamaan yhteyttä kaikille laitteille. Joidenkin tietokoneiden yhteys saattaa siis katketa yhtäkkiä.", " Voit tulostaa paperin molemmille puolille: Napsauta Tiedosto ▸ Tulosta. Mene tulostusikkunan Sivun asetukset -välilehdelle ja valitse Kaksipuolinen-pudotusvalikosta haluamasi vaihtoehto. Jos kaksipuolinen tulostaminen ei ole mahdollista tulostimellasi, pudotusvalikossa lukee \"Ei saatavilla\". Tulostimet käsittelevät kaksipuolista tulostamisia eri tavoin. Kokeile, miten oma tulostimesi toimii. Paperin yhdelle puolelle on mahdollista tulostaa useita sivuja. Käytä Sivuja puolelle -pudotusvalikkoa määrittääksesi, kuinka monta sivua paperin yhdelle puolelle tulostetaan. Yllä mainittujen valintojen näkyvyys saattaa riippua tulostimesi mallista ja käyttämästäsi sovelluksesta. Kyseinen valinta ei välttämättä ole aina näkyvissä.", " Verkkokaupoista ostettu musiikki ei välttämättä toimi Ubuntussa, etenkin jos ostit musiikin Windowsilla tai Mac OS X:llä ja kopioit sen jälkeen musiikin Ubuntuun. Tämä voi johtua siitä, että musiikki on sellaisessa tiedostomuodossa, jota tietokoneesi ei pysty toistamaan. Tämä korjaantuu yleensä helposti sillä, että asennetaan tuki puuttuvalle tiedostomuodolle - yleisimmin MP3-tiedostoille. Jos et ole asentanut tukea tiedostomuodolle (esimerkiksi MP3-tiedostot eivät toimi, ellet valinnut niiden tuen asentamista asennusohjelmassa tai asentanut jälkikäteen), sinun pitäisi saada asiasta huomauttava ilmoitus, kun yrität soittaa kappaletta. Ilmoituksessa on yleensä myös puuttuvan tuen asennusohjeet. Jos tiedostotuki on asennettu, mutta musiikki ei silti kuulu, musiikki voi olla kopiointisuojattua (tunnetaan myös DRM-suojattu). DRM-suojauksella voidaan rajoittaa musiikin käyttöä, kopiointia ja tallentamista määrän, laitteen ja käyttäjän mukaan. Kappaleen käyttöoikeuksia hallitsee siis musiikin myynyt yritys, et sinä. Jos tiedosto on DRM-suojattu, et todennäköisesti pysty soittamaan sitä. Kappaleiden soittamiseen vaaditaan yleensä myyjän oma ohjelma, ja tämä on harvoin saatavilla Linuxille. Lisätietoja digitaalisesta käyttöoikeuksien hallinnasta on tarjolla Electronic Frontier Foundationin sivustolla.", " Näytön kalibrointi on käytännössä vaatimus, jos teet tietokoneella graafista työtä. Käyttämällä kolorimetrin nimellä tunnettua laitetta on mahdollista mitata näytön kykeneväisyys esittää eri värejä. Voit luoda profiilin valitsemalla Järjestelmäasetukset ▸ Väri. Saat neuvoja, kuinka kolorimetri kytketään ja mitä asetuksia muutetaan. Näytöt vanhenevat. Litteiden TFT-näyttöjen taustavalojen valoisuusteho puolittuu noin 1,5 vuoden välein. Näytön kuva muuttuu keltaisemmaksi iän myötä. Tämän vuoksi on tärkeää kalibroida näyttö uudelleen, kun [!]-merkki on näkyvissä järjestelmäasetuksien värienhallinnassa. Myös litteät LED-näytöt ikääntyvät, mutta paljon hitaammin kuin TFT-näytöt.", " Valikkopalkki on tummanharmaa palkki näytön yläosassa. Se sisältää ikkunahallinnan painikkeet, sovellusvalikot ja tilavalikot. Ikkunahallinnan painikkeet ovat ikkunoiden vasemmassa ylänurkassa. Ikkunan ollessa suurennettuna painikkeet näkyvät näytön vasemmassa ylälaidassa. Napsauta painikkeita sulkeaksesi, pienentääksesi, suurentaaksesi tai palauttaaksesi kokoon ikkunoita. Sovellusvalikot sijaitsevat oletusarvoisesti ikkunahallinnan painikkeiden oikealla puolella. Unity piilottaa sovellusvalikot ja ikkunahallinnan painikkeet, mutta näyttää ne kun siirrät hiiren osoittimen näytön vasempaan yläreunaan tai kun painat Alt+F10. Näin näytöstä jää aiempaa enemmän tilaa varsinaiselle sisällölle. Voit halutessasi kiinnittää sovellusvalikot ikkunan otsikkopalkkiin, sekä asettaa valikot näkymään aina ilman hiiren kohdistusta. Napsauta järjestelmävalikkoa valikkopalkista ja valitse Järjestelmäasetukset. Napsauta Ulkoasu ja valitse Toiminta-välilehti. Aseta Ikkunan otsikkopalkissa valintaan Näytä ikkunan valikot. Aseta Valikkojen näkyvyys valintaan Aina näkyvissä. Ubuntussa on useita eri tilavalikkoja (toisinaan käytetään myös nimeä ilmaisin) valikkopalkin oikeassa laidassa. Tilavalikot mahdollistavat tietokoneen ja sovellusten tilan sekä asetusten tarkistamisen ja muuttamisen. Verkkovalikko  Yhdistä kiinteään, langattomaan, mobiililaajakaistaan, tai VPN-verkkoon. Syötelähdevalikko  Valitse näppäimistön asettelu, syötelähde, tee muutoksia syötelähteiden asetuksiin. Bluetooth-valikko  Lähetä tai vastaanota tiedostoja Bluetoothia käyttäen. Valikko ei ole näkyvissä, jos koneeseen ei ole kytketty Bluetooth-laitteita. Viestintävalikko  Vastaanota ilmoituksia ja käynnistä nopeasti viestintäsovellukset kuten sähköposti, sosiaaliset verkostot ja pikaviestit. Akkuvalikko  Tarkista akkusi latauksen tila. Tämä valikko on piilotettu, jos akkua ei havaita. Äänivalikko  Aseta äänenvoimakkuus, muokkaa ääniasetuksia ja ohjaa mediasoittimia kuten Rytmilaatikko. Kello Aika ja päivä näkyviin. Tapaamiset kalenterisovelluksesta näkyvät myös täällä. Järjestelmävalikko  Tietokoneen tiedot, tämä ohje ja järjestelmäasetukset Vaihda käyttäjien välillä, lukitse näyttö, kirjaudu ulos, siirry valmiustilaan, sammuta tai käynnistä tietokone uudelleen. Jotkin ilmaisinvalikoissa käytettävät kuvakkeet vaihtuvat riippuen sovellusten tilasta. Myös muut ohjelmat kuten Tomboy tai Transmission voivat lisätä oman ilmaisimensa paneeliin.", " Jos kadotit tai poistit tiedostoja ja niistä on varmuuskopiot, on tiedostot mahdollista palauttaa varmuuskopioista: Jos varmuuskopiot sijaitsevat erillisellä tallennusvälineellä, kuten esimerkiksi USB-muistitikulla, voit kopioida tiedostot takaisin tietokoneellesi. Jos loit varmuuskopion jollakin varmuuskopio-ohjelmalla, kuten Déjà Dupilla, on suositeltavaa käyttää samaa ohjelmaa varmuuskopioiden palauttamiseen. Tutustu ohjelman ohjeeseen, jos tarvitset ohjeita tiedostojen palauttamiseen.", " Voit vaihtaa hiiren (tai kosketuslevyn) vasemman ja oikean näppäimen paikkaa, jolloin hiirtä käyttäminen vasemmalla kädellä helpottuu. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. Valitse Yleiset-kohdasta Ensisijainen painike Oikea. Tämä asetus vaikuttaa hiireen, kosketuslevyyn ja kaikkiin muihin osoitinlaitteisiin.", " Voit perua tulostustyön ja poistaa sen tulostusjonosta tulostimen asetuksista. Jos aloitat tulostamisen vahingossa, voit perua tulostuksen ja näin säästää sekä paperia että mustetta. Napsauta kuvaketta aivan valikkopalkin oikeassa reunassa ja valitse Järjestelmäasetukset. Napsauta Tulostimet. Click the Show Jobs button on the right-hand side of the\n  Printers dialog. Cancel the print job by clicking the stop button on the\n  play-pause-stop symbols. Jos tämä ei peru tulostustyötä odotusten mukaisesti, koeta pitää hetki pohjassa tulostimessa olevaa Peru-painiketta. Viimeinen oljenkorsi, etenkin jos kyseessä on monisivuinen tulostustyö, on poistaa paperiarkit tulostimesta. Tulostin huomaa paperin olevan loppu, ja tulostustyö keskeytyy. Tässä vaiheessa on mahdollista yrittää perua tulostustyö uudelleen, tai vaihtoehtoisesti käynnistää tulostin uudelleen. Ole varovainen, ettet vahingoita tulostinta paperia poistaessa. Jos paperi ei tunnu irtoavan helpolla, voi olla parempi antaa sen olla ja pyytää apua. If you want to pause or release a print job, you can do so by going to the\n  jobs dialog in the printer settings and click the appropriate button. Napsauta kuvaketta aivan valikkopalkin oikeassa reunassa ja valitse Järjestelmäasetukset. Napsauta Tulostimet. Click the Show Jobs button on the right-hand side of the\n  Printers dialog and either pause or release the print job based on\n  your needs.", " Voit sallia pääsyn omiin Julkinen- ja Lataukset-kansioihisi Bluetooth-tiedostojakamisen kautta, ja sallia pääsyn vain luotetuista laitteista. Tee tarvittavat jakamisen asetukset käyttäen Omien tiedostojen jakoa. Bluetooth-laite on luotettu, jos olet parittanut eli yhdistänyt sen tietokoneeseen. Lue lisää ohjeesta Tietokoneen yhdistäminen Bluetooth-laitteeseen. Avaa Unity-valikosta Omien tiedostojen jako. Select the desired Bluetooth file sharing and receiving options from the list.", " Tämä sivu sisältää tärkeimmät pikanäppäimet, joiden avulla työpöydän ja sovellusten käyttö onnistuu entistä tehokkaammin. Jos et voi käyttää hiirtä tai muuta osoitinlaitetta, lue Näppäimistöllä liikkuminen saadaksesi lisätietoja, kuinka käyttöliittymien käyttö näppäimistöä käyttäen onnistuu. Alt+F4 Sulje nykyinen ikkuna. Alt+F2 Näytä komentoikkuna (komentojen syöttöä varten) Alt+Tab Nopea ja helppo vaihto ikkunoiden välillä. Vaihda selausjärjestystä pitämällä Shift pohjassa. Alt+` Vaihda saman ohjelman ikkunoiden tai ikkunanvaihtimen (Alt+Tab) ollessa avoinna siinä valitun ohjelman ikkunoiden välillä. Tämä pikanäppäin käyttää aina Tab-näppäimen yläpuolella olevaa näppäintä, joka on suomalaisella näppäimistöllä §. Kaikilla muilla näppäimistöasetteluilla näppäinyhdistelmä on Alt ja Tab-näppäimen yläpuolella oleva näppäin. Super+S Avaa työtilanvaihtimen ja sen ollessa jo auki poistuu siitä. Super+W Avaa Ikkunat-näkymän. Näyttää kaikki avoinna olevat ikkunat nykyisestä työtilasta. Ctrl+Alt+Nuolinäppäimet Vaihda työtilojen välillä. Ctrl+Alt+Shift+Nuolinäppäimet Siirrä nykyinen ikkuna eri työtilaan. Ctrl+Alt+Delete Kirjaudu ulos. Ctrl+Super+D Piilottaa kaikki ikkunat ja näyttää työpöydän. Palauta ikkunat painamalla näppäimiä uudelleen. Ctrl+Alt+L Lukitse näyttö. Ctrl+A Valitse nykyisen alueen kaikki kohteet. Ctrl+X Leikkaa (poista) valittuna oleva teksti tai kohteet ja kopioi se leikepöydälle. Ctrl+C Kopioi valittu teksti tai kohteet leikepöydälle. Ctrl+V Liitä leikepöydän sisältö. Ctrl+Z Peru viimeisin toiminto. Print Screen Ota kuvakaappaus. Alt+Print Screen Ota kuvakaappaus ikkunasta. Shift+Print Screen Ota kuvankaappaus haluamastasi alueesta. Osoitin muuttuu tähtäimeksi. Paina hiiren ykkösnäppäin pohjaan ja valitse haluamasi alue.", " Kun tietokonetta käytetään lentokoneessa tai jollain muulla alueella, jossa langattomien yhteyksien käyttäminen ei ole sallittua, kaikki langattomat laitteet, mukaan lukien tietokoneesi langaton verkkokortti, tulisi sammuttaa. Langattoman yhteyden katkaiseminen säästää myös virtaa, joten jos et tarvitse Internet-yhteyttä tai sitä ei ole saatavilla, se kannattaa etenkin akkukäytössä kytkeä pois päältä. Langattoman verkon voit kytkeä pois päältä verkkovalikon kautta poistamalla valinnan kohdasta Ota langaton käyttöön. Tämä kytkee langattoman verkkoyhteyden pois päältä kunnes kytket sen samalla tavalla uudelleen päälle. Takaisin päälle kytkeminen tapahtuu siis valitsemalla Ota langaton käyttöön uudelleen verkkovalikosta (niin että sen edessä on valintamerkki). Muista kytkeä pois päältä myös kannettavan tietokoneen Bluetooth-yhteys.", " Kirjanmerkkisi näkyvät tiedostonhallinnan sivupalkissa. Avaa kansio tai sijainti, jonka haluat lisätä kirjanmerkiksi. Click Bookmarks in the menu bar and select\n    Bookmark this Location. Click Bookmarks in the menu bar and select Bookmarks...\n   from the app menu.  In the Bookmarks window, select the bookmark you wish to\n   delete and click the - button. Click on Files in the top bar and pick Bookmarks\n     from the app menu. Valitse Kirjanmerkit-ikkunasta se kirjanmerkki, jonka haluat nimetä uudelleen. Kirjoita Nimi-kenttään kirjanmerkin uusi nimi. Kirjanmerkin uudelleennimeäminen ei muuta kansion nimeä. Jos useampi kirjanmerkki osoittaa kahteen samannimiseen kansioon, kirjanmerkeillä on sama nimi ja niiden erottaminen toisistaan on lähes mahdotonta. Näissä tapauksissa kirjanmerkin nimen muuttaminen on hyödyllistä.", " Voit käyttää tiedoston käyttöoikeuksia määrittääksesi, kuka tai ketkä voivat katsella ja muokata tiedostojasi. Aseta tiedoston käyttöoikeudet napsauttamalla tiedostoa hiiren oikealla painikkeella ja valitsemalla valikosta Ominaisuudet. Valitse avautuvasta ikkunasta Oikeudet-välilehti. Lue Tiedostot ja Kansiot saadaksesi lisätietoja, minkälaisia oikeuksia voit asettaa. Käyttöoikeuksia voi asettaa tiedoston omistajalle, ryhmälle sekä järjestelmän muille käyttäjille. Olet omien tiedostojesi omistaja ja voit antaa itsellesi joko pelkät lukuoikeudet tai sekä luku- että kirjoitusoikeudet tiedostoihisi. Jos et halua vahingossa muuttaa tiedostoa, aseta se vain-luku -muotoon. Jokainen tietokoneen käyttäjä kuuluu johonkin ryhmään. Kotikoneille on yleistä, että jokaisella käyttäjällä on oma ryhmä eikä ryhmien käyttöoikeuksia käytetä kovin usein. Yritysjärjestelmissä ryhmiä voidaan käyttää eri osastojen tai projektien välillä. Jokainen tiedosto kuuluu jollekin ryhmälle sen lisäksi, että sillä on omistaja. Voit valita tiedostolle ryhmän ja hallita täten kaikkien kyseiseen ryhmään kuuluvien henkilöiden käyttöoikeutta kyseiseen tiedostoon. Voit asettaa tiedostolle ryhmäksi vain sellaisen ryhmän, johon itse kuulut. Voit määritellä oikeudet myös kaikille käyttäjille sekä käyttäjille jotka ovat tiedoston ryhmässä. Jos tiedosto on ohjelma ja haluat suorittaa sen tiedostonhallinnasta, täytyy asetus Salli tiedoston suorittaminen ohjelmana olla käytössä. Tiedostohallinta voi kuitenkin yhä avata tiedoston jossakin ohjelmassa tai kysyä sinulta, mitä tehdä. Lue Suoritettavat tekstitiedostot saadaksesi lisätietoa. Voit asettaa kansioiden käyttöoikeuksia omistajan, ryhmän ja muiden käyttäjien osalta. Lue selitykset omistajalle, ryhmälle ja muille käyttäjille yläpuolelta Tiedostojen käyttöoikeuksista. Kansioille asetettavat oikeudet eroavat tiedostoille annettavista oikeuksista. Käyttäjä ei näe edes kansion sisältöä. Käyttäjä näkee kansion sisällön, mutta ei voi avata, luoda tai poistaa tiedostoja. Käyttäjä voi avata kansiossa olevia tiedostoja (olettaen että tiedoston käyttöoikeudet niin sallivat), mutta käyttäjä ei voi luoda tai poistaa tiedostoja. Käyttäjällä on täydet oikeudet kansioon, eli tiedostoja on mahdollista avata, luoda ja poistaa. You can also quickly set the file permissions for all the files\n    in the folder by clicking Change Permissions for Enclosed Files.\n    Use the drop-down lists to adjust the permissions of contained files or\n    folders, and click Change. Permissions are applied to files and\n    folders in subfolders as well, to any depth.", " Useimmat tulostimet mahdollistavat suoraan kirjekuoreen tai tarraetiketeille tulostamisen. Tästä on paljon hyötyä, jos olet aikeissa lähettää esimerkiksi lukuisia kutsuja. Kun olet aikeissa tulostaa kirjekuoreen, tarkista kaksi asiaa. Ensimmäinen asia on varmistaa, että tulostimesi tietää mitä kokoa kirjekuori on. Napsauta Tulosta, jolloin tulostusikkuna aukeaa. Tarkista Sivun asetukset -välilehdeltä Paperin tyyppi -pudotusvalikosta, onko tarjolla valintaa \"Kirjekuori\". Jos tätä valintaa ei syystä tai toisesta ole tarjolla, valitse Paperin koko -pudotusvalikosta käyttämäsi kirjekuoren koko (esim. C5). Ostamassasi kirjekuoripakkauksessa mitä luultavimmin mainitaan, mitä kokoa kyseiset kirjekuoret ovat. Toinen varmistettava asia on, että kirjekuoret ovat oikein päin tulostimessa. Tarkista tulostimen ohjekirjasta, miten kirjeet tulee asettaa tulostimeen. Voit myös halutessasi kokeilla yhteen kirjekuoreen, jolloin viimeistään selviää miten kirjekuoret tulee asettaa tulostimeen. Jotkin tulostimet eivät kykene tulostamaan kirjekuoria. Tällaisia tulostimia ovat etenkin laser-tulostimet. Tarkista tulostimesi ohjekirjasta, pystyykö kyseinen tulostin tulostamaan kirjekuoria. Tulostin, jota ei ole suunniteltu tulostamaan kirjekuoria, saattaa vahingoittua syöttäessäsi kirjekuoren kyseiseen tulostimeen.", " Jos hiiressäsi on johto, varmista että se on kunnolla kiinni tietokoneessa. Jos hiiri on tyyppiä USB (suorakulmainen liitin), kokeile liittää hiiri toiseen USB-porttiin. Jos hiiri on tyyppiä PS/2 (pieni pyöreä liitin jossa on kuusi piikkiä), varmista että hiiri on kytketty hiirelle tarkoitettuun vihreään porttiin eikä näppäimistölle tarkoitettuun liilaan porttiin. Koneen uudelleenkäynnistys saattaa olla tarpeen, jos hiiri ei ollut liitetty oikein. Paina Ctrl+Alt+T avataksesi päätteen. Pääte-ikkunassa kirjoita komento xsetpointer -l | grep Pointer tarkalleen kuten edellä ja paina rivinvaihtoa Enter. Lyhyt osoitinlaitteiden lista ilmestyy näkyviin. Tarkista, että ainakin yhdellä rivillä on teksti [XExtensionPointer] ja ainakin yhdellä tekstin [XExtensionPointer] sisältävällä rivillä on myös osoitinlaitteen nimi. Jos yhdelläkään rivillä ei lue tekstiä [XExtensionPointer], kone ei ole tunnistanut hiirtä. Jos jollakin rivillä lukee kyseinen teksti, koneesi on tunnistanut hiiren. Tässä tapauksessa tarkista, että hiiri on liitetty kunnolla ja että se toimii. Jos käytät sarja-liitin hiirtä (RS-232), saattaa olla tarpeen suorittaa lisätoimenpiteitä saadakseen sen toimimaan. Hiiren merkki ja malli vaikuttavat vaadittaviin toimenpiteisiin. Jos hiiren tunnistamisessa ilmenee ongelmia, niiden korjaaminen saattaa olla monimutkaista. Pyydä tukea hiiren valmistajalta tai maahantuojalta ongelmatilanteissa. Liitä hiiri toiseen tietokoneeseen ja varmista, että hiiri toimii siinä. Jos hiiri on optinen tai laserhiiri, hiiren pohjalla pitäisi näkyä valo sen ollessa päällä. Jos valoa ei näy, tarkista, että se on kytketty päälle. Jos valoa ei vieläkään näy, hiiri voi olla rikki. Varmista, että hiiri on päällä. Hiiren pohjassa on usein kytkin, jonka avulla hiiren voi sammuttaa kokonaan. Jos käytössäsi on Bluetooth-hiiri, varmista, että olet luonut yhteyden tietokoneen ja hiiren välille. Lue Tietokoneen yhdistäminen Bluetooth-laitteeseen saadaksesi lisätietoa laitteen yhdistämisestä. Napsauta hiiren painiketta ja seuraa, siirtyykö hiiren osoitin nyt. Jotkin langattomat hiiret säästävät sähköä siirtymällä lepotilaan, joten hiirtä on napsautettava hiiren herättämiseksi: Hiiri reagoi viivellä ennen kuin se alkaa toimia Varmista, että hiiren akku/paristot on ladattu. Varmista, että vastaanotin on kunnolla kiinnitetty tietokoneeseen. Jos hiiri ja vastaanotin on mahdollista asettaa eri taajuuksille, varmista että ne kummatkin käyttävät samaa taajuutta. Saattaa olla tarpeen painaa jotain nappia hiirellä, vastaanottimessa tai kummassakin saattaakseen yhteys kuntoon. Hiiren käsikirjasta löydät tarkemmat ohjeet tämän suhteen. Suurin osa langattomista RF-hiriistä toimii automaattisesti, kun ne yhdistetään tietokoneeseen. Langaton Bluetooth- tai infrapuna-hiiri saattaa mallista riippuen vaatia joitakin säätötoimenpiteitä ennen kuin hiiri alkaa toimimaan.", " Seuraavanlaiset kohteet ovat tuettuja: CMP DigitalTarget ColorChecker 24 ColorChecker DC ColorChecker SG i1 RGB Scan 14 LaserSoft DC Pro QPcard 201 IT8.7/2 Voit ostaa tunnettujen yritysten, kuten Kodak, X-Riteja LaserSoft, kalibrointikohteita useista verkkokaupoista. Kalibrointikohteita myy edullisesti myös saksalainen Wolf Faust.", " WEP, WPA ja uudempi WPA2 ovat langattoman verkon salaustekniikoita. Salaaminen estää verkon luvattoman käytön, jotta kukaan ei voisi \"salakuunnella\" yhteyttä tai tarkastella millä verkkosivuilla yhteydellä on käyty. WEP on lyhenne sanoista Wired Equivalent Privacy ja WPA sanoista Wireless Protected Access. WPA2 on WPA:n kehittyneempi ja uudempi versio. Näistä suojauksista edes jonkun käyttäminen on parempi kuin ei mitään, mutta näistä tekniikoista vähiten suositeltavin vaihtoehto on WEP heikomman turvallisuutensa takia, joten sitä kannattaa mahdollisuuksien mukaan välttää. Näistä kolmesta turvallisin on WPA2. Jos tietokoneesi langaton verkkolaite ja langaton tukiasema tukevat tätä standardia, sitä kannattaa ehdottomasti käyttää verkkoon yhdistämisessä.", " Jos luot usein samaan sisältöön perustuvia asiakirjoja, voit hyötyä asiakirjamallien käytöstä. Asiakirjamalli voidaan luoda kaikenlaisista asiakirjoista käyttäen asettelua ja sisältöä, jota haluat käyttää uudelleen. Esimerkiksi voit luoda asiakirjamallin, josta löytyy usein käyttämäsi ylätunniste. Luo asiakirja, jota tulet käyttämään asiakirjamallina. Voit esimerkiksi luoda asiakirjapohjan tekstinkäsittelyohjelmaan. Tallenna asiakirjapohja Kotikansion alikansioon Mallit. Tarvittaessa luo Mallit-kansio. Avaa kansio, jonne haluat tallentaa uuden asiakirjan. Napsauta hiiren oikealla painikkeella missä tahansa kansiossa näkyvää tyhjää tilaa ja valitse Uusi asiakirja. Käytettävissä olevat asiakirjamallit näkyvät alivalikossa. Valitse haluamasi malli luettelosta. Syötä uudelle asiakirjalle tiedostonimi. Avaa tiedosto kaksoisnapsauttamalla sitä ja aloita muokkaus.", " Kamerat kalibroidaan yleisesti ottamalla valokuva kohteesta hyvissä valo-olosuhteissa. Kun RAW-kuva muunnetaan TIFF-tiedostoksi, sitä voidaan käyttää kameran kalibrointiin värienhallinnassa. TIFF-kuva täytyy rajata siten, että vain kohde on näkyvissä. Varmista, että valkoiset tai mustat reunaviivat ovat näkyvissä. Kalibrointi ei toimi, jos kuva on ylösalaisin tai vääristynyt suuresti. Valmis profiili on kelvollinen vain siinä valaistuksessa, jossa alkuperäinen kuva on otettu. Tämä tarkoittaa, että profilointi saattaa olla tarpeen tehdä useaan kertaan studiokäyttöä, kirkasta päivänvaloa, pilvistä säätä jne. varten.", " Bluetooth-laitteeseen (kuten puhelimeen tai kuulokemikrofoniin) yhdistämisen epäonnistuminen voi johtua useista eri syistä. Tietyt Bluetooth-laitteet estävät oletuksena yhteydet tai vaativat asetusten muuttamista yhteyden luomiseksi. Varmista, että laite on asetettu hyväksymään yhteydet. Tietokoneesi ei välttämättä ole tunnistanut Bluetooth-sovitintasi. Tämä voi johtua siitä, että sovittimen ajureita ei ole asennettu. Osa Bluetooth-sovittimista ei tue Linuxia, ja et välttämättä löydä niille toimivia ajureita. Tällaisissa tapauksissa lienee tarpeen hankkia toinen Bluetooth-sovitin. Varmista, että Bluetooth-sovitin on kytketty päälle. Avaa valikkopalkin Bluetooth-valikko ja tarkista, että Bluetooth on käytössä. Tarkista, että Bluetooth on käytössä myös laitteessa, johon yrität luoda yhteyttä. Jos esimerkiksi yrität yhdistää puhelimeen, varmista, että se ei ole lentokonetilassa. Useissa tietokoneissa ei ole Bluetooth-sovitinta. Voit ostaa sovittimen esimerkiksi USB-väylään, jos haluat käyttää Bluetoothia.", " Tietokone toistaa tietyn äänimerkin tietyissä tilanteissa, kuten ilmoituksissa. Voit halutessasi valita äänimerkin muutamasta vaihtoehdosta, säätää sen äänenvoimakkuutta tai poistaa sen kokonaan käytöstä. Avaa äänivalikko valikkopalkista ja napsauta Ääniasetukset. Äänitehosteet-välilehdellä valitse haluamasi hälytysääni. Voit esikuunnella ääntä napsauttamalla sitä. Voit muuttaa valitsemasi hälytysäänen voimakkuutta Äänitehosteet-välilehdellä käyttämällä äänenvoimakkuussäädintä. Tämän asetuksen muuttaminen ei muuta musiikin, elokuvien ja muiden äänilähteiden voimakkuutta. Jos haluat vaimentaa hälytysäänet kokonaan, napsauta Vaimenna Hälytysvoimakkuuden vierestä.", " Sovelluksen lisääminen käynnistimeen nopeaa käyttöä varten: Vedä sovelluksen kuvake Unity-valikosta käynnistimeen. Vaihtoehtoinen tapa on käynnistää sovellus, jonka jälkeen sovelluksen kuvake ilmestyy käynnistimeen. Napsauta sovelluksen kuvaketta hiiren oikealla painikkeella ja valitse Kiinnitä käynnistimeen. Käynnistimen kuvakkeiden järjestystä voi muuttaa vetämällä kuvakkeen pois käynnistimestä, ja pudottamalla kuvakkeen haluttuun paikkaan. Jos haluat sovelluksen pois käynnistimestä, napsauta kyseistä sovelluksen kuvaketta hiiren oikealla ja valitse Poista käynnistimestä.", " Jos tietokone ei osaa määrittää verkon asetuksia itse automaattisesti, ne pitää tehdä itse. Tässä ohjeessa oletetaan, että verkon tiedot ovat jo valmiiksi tiedossa. Jos niitä ei tiedetä, kannattaa tiedustella niitä verkkosi ylläpitäjältä (esimerkiksi operaattorilta) tai tutkailla reitittimen tai langattoman tukiaseman tietoja (niiden kyljessä on usein lappu, jossa tiedot mainitaan). Avaa verkkovalikko valikkopalkista ja napsauta Muokkaa yhteyksiä... Etsi yhteys, jonka asetukset haluat määrittää. Esimerkiksi tietokoneeseen on kytketty Ethernet- eli verkkokaapeli, tarkastele Kiinteä-välilehteä. Valitse haluamasi yhteys ja napsauta Muokkaa... Siirry IPv4-asetukset-välilehdelle ja vaihda Menetelmä-kohtaan Manuaalinen. Napsauta Lisää ja kirjoita IP-osoite, verkkopeite ja yhdyskäytävä niille osoitetuille paikoille Osoitteet-osiossa. Paina lopuksi Enter. These three addresses must be IP addresses; that is, they must be four numbers separated by periods (e.g., 123.45.6.78). Kirjoita niiden DNS-palvelimien IP-osoitteet joita halutaan käyttää pilkulla eroteltuna niille kuuluvaan kenttään. Napsauta lopuksi Tallenna. Jos yhteys ei muodostu automaattisesti, muodosta se verkkovalikon kautta. Kokeile verkkoyhteyden toimivuutta esimerkiksi avaamalla jokin nettisivu.", " Toisinaan ystävä, perheenjäsen tai työkaveri saattaa haluta käyttää hetken tietokonettasi. Ubuntun Vierasistunto mahdollistaa tietokoneen lainaamisen toisen käyttöön turvallisesti. Vierasistunnon voi käynnistää joko kirjautumisnäkymästä tai normaalin istunnon sisältä. Jos olet jo kirjautunut sisään, napsauta kuvaketta valikkopalkin oikeassa reunassa ja valitse Vierasistunto. Tämä lukitsee istuntosi ja aloittaa uuden vierasistunnon. Vieras ei voi käyttää muiden käyttäjien kotikansiota ja oletuksena kaikki tallennetut tiedostot ja muutokset poistetaan/palautetaan oletuksiksi uloskirjautumisen yhteydessä. Jokaisella kerralla vierastili on kuin uusi, sillä siellä ei ole mitään edellisen käyttäjän jäljiltä. Englanninkielinen verkko-opas vierasistunnon mukauttamiseen antaa vinkkejä vierasistunnon ulkoasun ja toimintojen muokkaamiseen. If you prefer to not allow guest access to your computer, you can disable the Guest\nSession feature. To do so, press Ctrl+Alt+T\nto open a terminal window, and then run this command: sudo sh -c 'printf \"[Seat:*]\\nallow-guest=false\\n\" >/etc/lightdm/lightdm.conf.d/50-no-guest.conf' Komento luo pienen asetustiedoston. Jos haluat ottaa vierasistunnon uudelleen käyttöön, poista kyseinen tiedosto seuraavalla komennolla: sudo rm /etc/lightdm/lightdm.conf.d/50-no-guest.conf", " Langaton verkko on mahdollista \"piilottaa\". Piilotettuja verkkoja ei esitetä verkkovalikossa. Yhdistä piilotettuun langattomaan verkkoon seuraavasti: Napsauta verkkovalikkoa valikkopalkissa ja valitse Yhdistä piilotettuun langattomaan verkkoon. Määritä avautuvaan ikkunaan verkon nimi ja langattoman tietoturvan tyyppi, napsauta sitten Yhdistä. Langattoman tukiaseman/reitittimen nimen löytää laitteesta. Verkkoa kutsuttaneen nimellä BSSID (Basic Service Set Identifier), jolloin nimi näyttää tällaiselta: 02:00:01:02:03:04. Tarkista myös tukiaseman salausasetukset; etsi termejä WEP, WPA ja WPA2. Verkon asettaminen piilotetuksi ei useimmiten lisää sen turvallisuutta, sillä verkko on edelleen löydettävissä pienellä vaivannäöllä.", " Voit kirjoittaa tai katsella tuhansilla eri merkeillä, joita esiintyy maailman eri kirjoitusjärjestelmissä. Myös niillä, joita ei näppäimistöstäsi löydy. Tämä sivu kuvaa eri tapoja erikoismerkkien käyttöön. Merkkikartan avulla voit selata Unicode-järjestelmän kaikkia merkkejä. Etsi haluamasi merkki käyttäen merkkikarttaa, sitten kopioi ja liitä se toiseen sovellukseen. Löydät Merkkikartan Unity-valikosta. Lisätietoja merkkikartasta saat sen omasta ohjeesta. Voit kirjoittaa minkä tahansa Unicode-merkin käyttäen näppäimistöäsi ja ns. koodiarvoja. Jokaisella merkillä on oma nelimerkkinen koodiarvo. Etsi haluamasi merkin koodiarvo avaamalla Merkkikartta ja valitsemalla haluamasi merkki. Näet kyseisen merkin koodiarvon ikkunan vasemmassa alakulmassa tai Merkin yksityiskohdat -välilehdeltä. Koodiarvo on merkinnän U+ jälkeen näkyvät neljä merkkiä. To enter a character by its code point, press\n    Ctrl+Shift+U, type the\n    four-character code point, and press Enter. If you \n    often use characters that you can't easily access with other methods, \n    you might find it useful to memorize the code point for those \n    characters so you can enter them quickly. Voit asettaa näppäimistösi toimimaan myös myös toisella kielellä huolimatta siitä, mitkä merkit näppäimistössä fyysisesti on. Voit vaihdella eri syötemenetelmien välillä valikkopalkin kuvakkeen avulla. Lisätietoja ohjeessa Käytä vaihtoehtoisia syötelähteitä.", " Jos musiikkisoittimesi (esim. MP3-soitin) on kytketty tietokoneeseen, mutta et näe sitä musiikkisovelluksessa, soitinta ei välttämättä ole tunnistettu musiikkisoittimeksi. Irrota soitin ja kiinnitä se takaisin. Jos tämä ei auta, avaa tiedostoselain. Musiikkisoittimesi pitäisi näkyä tiedostoselaimen sivupalkissa Laitteet-osiossa. Avaa kyseessä olevan laitteen kansio napsauttamalla laitteen nimeä. Valitse Tiedosto ▸ Luo uusi asiakirja ▸ Tyhjä asiakirja, anna uudelle tiedostolle nimeksi .is_audio_player ja paina Enter (piste ja alaviivat ovat tärkeitä, ja myös nimi tulee kirjoittaa pienillä kirjaimilla). Tämä tiedosto auttaa tietokonetta tunnistamaan laitteen musiikkisoittimeksi. Etsi musiikkisoitin tiedostoselaimen sivupalkista ja irrota se (napsauta hiiren oikealla painikkeella ja valitse Irrota). Ota laite irti tietokoneestasi ja liitä se takaisin. Tällä kertaa musiikkiohjelman tulisi tunnistaa laite musiikkisoittimeksi. Jos näin ei tapahtunut, kokeile, korjaako musiikkiohjelma uudelleenkäynnistys ongelman. Nämä ohjeet eivät toimi iPodin ja joidenkin muiden musiikkisoittimien kanssa. Ohjeet pätevät, kunhan soitin on USB-massamuistina. Tästä on yleensä maininta laitteen käyttöohjeessa tai valmistajan verkkosivustolla. Kun tutkit musiikkisoittimen kansiota, et näe .is_audio_player-tiedostoa. Tämä johtuu siitä, että piste tiedostonimen edessä määrittelee tiedoston piilotiedostoksi ja täten tiedostoselain piilottaa sen. Voit tarkistaa tiedoston olemassaolon valitsemalla Näytä ▸ Näytä piilotiedostot.", " On kaksi tapaa profiloida tulostinlaite: Fotospektrometrin käyttäminen (esim. Pantone ColorMunki) Väriyrityksen vertaustiedoston lataaminen ja tulostaminen Väreihin erikoistuneen yrityksen käyttäminen tulostinprofiilin luomiseen on yleensä halvin tapa, jos käytössä on vain yksi tai kaksi erilaista paperityyppiä. Lataamalla vertauskaavion yrityksen WWW-sivustolta on mahdollista lähettää kaavio takaisin tulostettuna kirjekuoressa, minkä jälkeen yritys lukee kuvan digitaaliseksi ja luo profiilin. Profiili lähetetään sähköisenä, tarkkana ICC-profiilina. Kalliin laitteen, kuten ColorMunki, käyttäminen tulee halvemmaksi vain, jos profiloidaan suuria määriä erilaisia tulostimia tai paperityyppejä. Jos vaihdat mustekasettien toimittajaa, muista kalibroida tulostin uudelleen!", " Kun kytket iPodin tietokoneeseen, se näkyy musiikkisoittimessa ja myös tiedostonhallinnassa (Kotikansio-sovellus käynnistimessä). Kappaleiden siirto tulee tehdä musiikkisoittimella - tiedostonhallinnan käyttäminen ei toimi, sillä kappaleet eivät siirry oikeaan kansioon. iPodeissa on nimittäin tietty sijainti kappaleiden tallennukseen, jota musiikkisoitin osaa käyttää, mutta tiedostonhallinta ei. Odota kunnes kappaleet on varmasti kopioitu kokonaan, ennen kuin irrotat iPodin tietokoneesta. Ennen irrottamista muista myös poistaa laite turvallisesti. Näin varmistutaan, että kaikki kappaleet on kopioitu oikein. A further reason why songs might not be appearing on your iPod is that the music player application you're using does not support converting the songs from one audio format to another. If you copy a song which is saved in an audio format that is not supported by your iPod (for example, an Ogg Vorbis (.oga) file), the music player will try to convert it to a format that the iPod does understand, such as MP3. If the appropriate conversion software (also called a codec or encoder) is not installed, the music player will not be able to do the conversion and so will not copy the song. Look in the software installer for an appropriate codec.", " Bluetooth-näkyvyydellä tarkoitetaan yksinkertaisesti sitä, että muut laitteet voivat havaita tietokoneesi, kun etsivät Bluetooth-laitteita. Kun Bluetooth-näkyvyys on käytössä, tietokoneesi on avoin kaikille muille laitteille, jotka ovat Bluetooth-kantaman sisällä, jolloin ne voivat yrittää ottaa yhteyttä tietokoneeseesi. Kun muita laitteita etsitään, tietokoneen ei tarvitse olla näkyvissä. Muiden laitteiden tulee kuitenkin olla näkyvissä, jotta tietokone voi löytää ne. Kun olet muodostanut yhteyden laitteeseen, kyseisen laitteen tai tietokoneesi ei tarvitse enää olla näkyvissä ollakseen yhteydessä toisiinsa. Jos sinun tai jonkun johon luotat tarvitsee yhdistää tietokoneeseesi toisesta laitteesta, jätä näkyvyys pois päältä.", " Paras tapa hankkia profiileja on luoda ne itse, vaikkakin tämä tarkoittaa aluksi jonkin verran kustannuksia. Monet laitevalmistajat yrittävät tarjota väriprofiileja laitteille, vaikkakin jotkin niistä on laitettu ajuripakettien sekaan joista väriprofiilien irrottaminen voi vaatia hieman vaivannäköä. Jotkin laitevalmistajat eivät tarjoa tarkkoja profiileja laitteilleen, jolloin profiilit ovat syytä jättää käyttämättä. Hyvä tarkistus on noutaa profiili, ja jos profiilin luontipäivämäärä on yli vuoden aiempi kuin laitteesi ostopäivämäärä, profiili on tällöin luultavasti itsestään luotua, hyödytöntä valedataa. Lue Miksi minun pitää tehdä kalibrointi itse? ymmärtääksesi, minkä vuoksi valmistajien tarjoamat profiilit ovat yleensä täysin hyödyttömiä.", " Monet hämääntyvät usein kalibroinnin ja profiloinnin eroista. Kalibrointi on laitteen väriominaisuuksien muokkausta. Tämä toteutetaan yleensä kahdella tavalla: Muuttamalla laitteen omia väreihin vaikuttavia arvoja Lisäämällä käyriä värikanaviin Kalibroinnin tarkoitus on laittaa laite määrättyyn tilaan värivasteen suhteen. Tätä käytetään usein päivittäisenä toimena toistettavissa olevan värikäyttäytymisen saavuttamiseksi. Tavallisesti kalibrointia säilytetään laite- tai järjestelmäkohtaisissa tiedostomuodoissa, joihin tallennetaan laiteasetukset tai kanavakohtaiset kalibrointikäyrät. Karakterisointi (eli profilointi( on laitteen värien toistamisen tallentamista. Tulos tallennetaan yleensä laite-ICC-profiiliksi. Profiili ei muokkaa itsessään väriä, vaan se mahdollistaa CMM-järjestelmien (Color Management Module) tai väriasioita ymmärtävän ohjelman värien muokkaamiseen yhdessä toisen laitteen profiilin kanssa. Vain tietämällä kahden laitteen profiili on mahdollista siirtää värien toisto laitteelta toiselle onnistuneesti. Huomaa, että kuvantaminen (profiili) on voimassa laitteelle, jos se on samassa tilassa kuin se oli kalibroitaessa. Näyttöprofiilien tapauksessa saattaa olla hämmennystä aiheuttavaa, että kalibrointitiedot tallennetaan usein mukavuussyistä. Tapana on tallentaa tiedot vcgt-merkintään. Vaikka se tallennetaan profiiliin, mikään tavallista ICC-työkaluista tai sovelluksista ei ole tietoinen siitä eikä tee sillä mitään. Samaan tapaan tavalliset näytön kalibrointityökalut ja -sovellukset eivät ole tietoisia siitä tai käytä tätä ICC-karakterisointitietoa.", " Yleisprofiilit ovat yleensä huonoja. Kun valmistaja tekee uuden mallin, he ottavat vain muutaman näytteen tuotantolinjalta ja keskiarvoistavat ne. Näyttöpaneelien sävyt voivat vaihdella melko paljon yksilöstä toiseen, ja myös näytön vanhetessa. Tulostimien tapauksessa lisähankaluuksia tuovat erilaiset mahdolliset paperityypit ja -painot, jotka voivat tehdä tehdä karakterisointitilasta epäkelvon ja profiilista epätarkan. Paras tapa varmistaa profiilin tarkkuus on tehdä kalibrointi joko itse tai ulkopuolisen yrityksen suorittamana.", " Voit lähettää tiedostoja Bluetooth-laitteisiin, joihin olet muodostanut yhteyden, kuten matkapuhelimiin ja toisiin tietokoneisiin. Jotkin laitteet eivät salli tiedostonsiirtoja tai tiettyjen tiedostotyyppien siirtämistä.Voit siirtää tiedostoja joko valikkopalkin Bluetooth-kuvakkeella, Bluetooth-asetuksien ikkunasta tai suoraan tiedostonhallinnsta. Lähettääksesi tiedostoja suoraan tiedostonhallinnasta, lue Jaa ja siirrä tiedostoja. Ennen aloittamista, varmista että Bluetooth on kytketty päälle. Katso Bluetoothin kytkeminen päälle tai pois. Napsauta Bluetooth-kuvaketta valikkopalkissa ja valitse Lähetä tiedostoja laitteelle.... Valitse tiedosto, jonka haluat lähettää, ja napsauta Valitse. Valitse useita tiedostoja kerralla pitämällä Ctrl pohjassa, kun napsautat haluamiasi tiedostoja. Valitse listalta laite, johon haluat lähettää tiedostoja, ja napsauta sitten Lähetä. Laitelistasta löytyvät kaikki lähistöllä olevat Bluetooth-laitteet jo yhdistettyjen laitteiden lisäksi. Jos laitteeseen ei ole vielä luotu yhteyttä, yhteyden muodostaminen suoritetaan Lähetä painikkeen painalluksen jälkeen. Tämä tarvitsee yleensä luvan myös toiselta laitteelta. Voit rajoittaa laitteita, valitsemalla vain tietyt laitteet Laitetyyppi-pudotusvalikosta. Vastaanottavan laitteen omistajan täytyy yleensä hyväksyä tiedoston vastaanottaminen. Kun omistaja hyväksyy tai hylkää tiedonsiirron, sen lopputulos esitetään näytölläsi. Napsauta Bluetooth-kuvaketta valikkopalkista ja valitse Bluetooth-asetukset.... Valitse vasemmanpuoleisesta luettelosta laite, johon tiedostot lähetetään. Luettelo näyttää ainoastaan laitteet johon olet jo yhdistänyt. Lue lisää kappaleessa Tietokoneen yhdistäminen Bluetooth-laitteeseen. Laitetiedoissa oikealla, napsauta Lähetä tiedostot. Valitse tiedosto, jonka haluat lähettää, ja napsauta Valitse. Valitse useita tiedostoja kerralla pitämällä Ctrl pohjassa, kun napsautat haluamiasi tiedostoja. Vastaanottavan laitteen omistajan täytyy yleensä hyväksyä tiedoston vastaanottaminen. Kun omistaja hyväksyy tai hylkää tiedonsiirron, sen lopputulos esitetään näytölläsi.", " Muikku-valokuvakopilla ja web-kameralla voi ottaa kuvia ja videoita, lisätä niihin hauskoja tehosteita ja jakaa niitä muiden kanssa. Tukea Cheesen käyttöön löytyy Cheesen käyttöoppaasta.", " Jotkin kannettavat tietokoneet hidastuvat tarkoituksellisesti akkuvirralla toimiessaan säästäkseen virtaa. Kannettavan tietokoneen suoritin vähentää kellotaajuutta, jolloin toiminta hidastu hieman, mutta samalla myös akkukesto paranee. Tätä kutsutaan nimellä CPU-taajuusskaalaus.", " Tämä on vaiheittainen ongelmanratkaisusopas, jonka tarkoitus on auttaa tunnistamaan ja korjaamaan langattomaan verkkoon liittyvät ongelmat. Jos langattoman verkon yhteydenmuodostus ei onnistu, kokeile seuraavia ohjeita. Seuraavat toimenpiteet suoritetaan tietokoneen yhdistämiseksi Internetiin: Perusasioiden tarkistus Laitteistoon liittyvien tietojen keräys Laitteiston tarkistus Langattoman yhteyden muodostusyritys reitittimeen Modeemin ja reitittimen tarkistus Aloita napsauttamalla tämän sivun oikeasta yläkulmasta Seuraava. Kulje oppaan läpi napsauttamalla taas seuraavalla sivulla taas Seuraava ja niin edelleen. Jotkin tämän oppaan ohjeet pyytävät syöttämään komentoja komentoriville (Pääte). Avaa Pääte-sovellus Unity-valikosta. Älä huoli, vaikka et olisi perehtynyt komentorivin käyttöön. Tämä ohje johdattaa vaihettain alusta loppuun. Muista vain, että komennoissa kirjainkoolla on merkitystä, joten komennot tulee kirjoittaa juuri kuten ne on kirjoitettu. Paina komennon kirjoituksen jälkeen Enter, joka suorittaa kirjoitetun komennon.", " Ota Bluetooth käyttöön käyttääksesi Bluetooth-laitteita, lähettääksesi ja vastaanottaaksesi tiedostoja, mutta sammuta se säästääksesi virtaa. Käynnistääksesi Bluetoothin, napsauta Bluetooth-kuvaketta valikkopalkista ja ota Bluetooth käyttöön. Monessa kannettavassa tietokoneessa on kytkin tai näppäinyhdistelmä, josta voi laittaa Bluetoothin päälle tai pois. Jos Bluetooth-laite on poissa käytöstä, et näe Bluetooth-kuvaketta valikkopalkissa. Etsi kytkintä tai näppäinyhdistelmää ottaaksesi Bluetoothin käyttöön. Näppäinyhdistelmään kuuluu yleensä Fn-näppäin. Sammuttaaksesi Bluetoothin napsauta Bluetooth-kuvaketta ja poista Bluetooth käytöstä. You only need to switch Visible on if you are connecting\nto this computer from another device. See Mitä Bluetooth-näkyvyys tarkoittaa?\nfor more information.", " Näppäimistöillä on satoja eri näppäinasetteluja eri kielille. Jopa samalle kielelle on usein useita näppäinasetteluja, kuten Dvorak-asettelu englannille. Voit säätää näppäimistösi käyttäytymään kuin näppäimistö eri asettelulla vaikka näppäimiin painetut kirjaimet ja merkit ovat aivan jotain muuta. Tämä on käytännöllistä, jos vaihdat usein eri kielien välillä. Some languages, such as Chinese or Korean, require a more complex input\n  method than just a simple key to character mapping. Consequently some of\n  the input sources you can choose between enable such a method. More about\n  that in the section Complex input methods. You can preview an image of any layout by selecting it in the list and clicking\n      . Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Napsauta Tekstisyöte. Napsauta +, valitse syötelähde ja napsauta Lisää. The default source is the source at the top of the list. Use the\n    ↑ and ↓ buttons to move sources up and down in\n    the list. If you select a source with an input method, you can click\n       to access that method's preferences dialog if any. You can quickly switch between selected sources using the input source\n    indicator in the menu bar. The menu will display a short identifier for the\n    current source, such as En for the standard English layout or a\n    symbol in case of a source that uses a special input method, e.g. Chinese\n    (Chewing). Click the input source indicator and select from the menu the\n    source you want to use. You can also use keyboard shortcuts to quickly switch between your selected\n    input sources. By default the shortcut for switching to next source is\n    Super+Space, but you\n    can change it: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Napsauta Tekstisyöte. Click the current shortcut definition below the label Switch to\n       next source using. When the shortcut definition has changed to New accelerator...,\n       press the keys you want to use as the new shortcut. When you use multiple sources, you can choose to have all windows use the\n    same source or to set a different source for each window. Using a different\n    source for each window is useful, for example, if you're writing an article\n    in another language in a word processor window. Your input source selection will\n    be remembered for each window as you switch between windows. By default, new windows will use the default input source. You can\n    instead choose to have them use the source of the window you were last\n    using. Recommended frameworks for input methods are IBus and\n    Fcitx. The latter is the default framework in Ubuntu for Chinese,\n    Japanese, Korean and Vietnamese. Input source options with input methods are only available if respective\n    input method (IM) engine is installed. When you install a language, a suitable\n    IM engine is automatically installed if applicable. For example, to prepare for typing Korean (Hangul) on an English system,\n    follow these steps: Install Korean. One of the\n        installed packages is fcitx-hangul, the Hangul IM engine for\n        Fcitx. Sulje Kielituki ja avaa se uudelleen. Select fcitx as the Keyboard input method system. Kirjaudu ulos ja takaisin sisään. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Napsauta Tekstisyöte. Napsauta +, valitse Hangul (Fcitx), ja napsauta Lisää. This will make Hangul available in the Fcitx input source indicator\n    in the menu bar. (The design differs from the IBus equivalent.) If you prefer some other IM engine than the one which is installed\n    automatically when you install a language, you can\n    install the IBus or Fcitx IM engine of\n    your choice separately.", " Jos haluat muuttaa asiakirjan tulostuksessa käytettävän paperin kokoa (esim. A3-asiakirja A4-tulosteeksi), se on mahdollista tulostusikkunan Sivun asetukset -välilehdellä. Napsauta Tiedosto ▸ Tulosta Valitse Sivun asetukset -välilehti. Valitse Paperin koko -pudotusvalikosta haluamasi paperin koko. Napsauta Tulosta ja nyt asiakirjasi pitäisi tulostua. Voit halutessasi muuttaa tulostussuuntaa Suunta-pudotusvalikosta: Pysty Vaaka Käänteinen pysty Käänteinen vaaka", " Kun kannettavien tietokoneiden akut vanhenevat, niiden latauskapasiteetti laskee. Voit yrittää vaikuttaa muutamalla tavalla akkujen käyttöikään. Älä anna akun tyhjentyä täysin. Liitä tietokone verkkovirtaan lataukseen, ennen kuin akku tyhjenee täysin. Lämpö vaikuttaa heikentävästi akun lataustehoon. Älä altista akkua ylimääräiselle lämmölle. Akun käyttöikä heikkenee myös sitä varastoidessa. Kannattaakin ostaa tietokoneen oston yhteydessä vara-akku. Käytä sitä, jos nykyisen akun käyttöaika heikkenee. Nämä ohjeet on suunniteltu litiumioni-akuille (Li-Ion), jollainen on käytössä suurimmassa osassa tietokoneista. Muun tyyppisiin akkuihin nämä ohjeet eivät välttämättä sovellu.", " Ubuntu sisältää uudenlaisen Unity-käyttöliittymän. Unityn suunnittelun painopisteinä on antaa sovelluksille mahdollisimman paljon tilaa ja samalla helpottaa työskentelyä. Tämä ohje on suunniteltu vastaamaan Unityn ja Ubuntun työpöydän käyttöön liittyviin kysymyksiin. Aluksi tutustumme Unityn keskeisimpiin ominaisuuksiin ja niiden hyödyntämiseen. Käynnistin ilmestyy näytön vasempaan reunaan automaattisesti sisäänkirjautumisen jälkeen. Sen ansiosta useimmin käytettyjen sovellusten käynnistäminen on nopeaa. Lisätietoja käynnistimestä. Ubuntu-painike on näytön vasemmassa yläkulmassa aina käynnistimen ylimpänä kuvakkeena. Jos napsautat Ubuntu-painiketta, Unity tuo esiin työpöydän ominaisuuden nimeltä Unity-valikko. Unity-valikko helpottaa sovellusten, tiedostojen, musiikin ja paljon muun etsimisessä, avaamisessa sekä käyttämisessä. Jos esimerkiksi kirjoitat \"document\" tai suomeksi \"asiakirja\" hakukenttään, Unity-valikko näyttää asiakirjojen kirjoittamiseen ja muokkaamiseen tarkoitetut sovellukset. Se näyttää myös hakuun liittyvät kansiot ja asiakirjat, joiden kanssa olet työskennellyt aiemmin. Lisätietoja Unity-valikosta.", " Voit käyttää kosketuslevyä napsautuksiin, kaksoisnapsautuksiin, raahaamiseen ja vierittämiseen ilman fyysisiä näppäimiä. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. Valitse Kosketuslevy-kohdasta valinta Napsauta napauttamalla. Kosketuslevy-osio näkyy vain, jos tietokoneessasi on kosketuslevy. Napsautus onnistuu kosketuslevyä napauttamalla. Kaksoisnapsautus onnistuu napauttamalla kosketuslevyä kahdesti. Raahaaminen onnistuu kaksoisnapauttamalla kosketusalustaa siten, ettet nosta sormeasi toisella napsautuksella. Raahaa kohde, minne haluat ja nosta sormi sen pudottamiseksi. Jos kosketuslevy tukee usean sormen napautuksia, voit simuloida hiiren oikean painikkeen napsautusta napauttamalla kosketuslevyä kahdella sormella samaan aikaan. Muussa tapauksessa sinun täytyy käyttää fyysisiä painikkeita hiiren oikean näppäimen napsautukseen. Lue toisesta tavasta simuloida hiiren oikeaa napsautusta artikkelista Simuloi hiiren oikean napin painallusta . Jos kosketuslevy tukee usean sormen napautuksia, hiiren keskimmäisen painikkeen napsautus onnistuu napauttamalla kosketuslevyä kolmella sormella samanaikaisesti. Kun napsauttelet ja raahaat kohteita usealla sormella, varmista, että sormesi ovat tarpeeksi kaukana toisistaan. Jos sormesi ovat liian lähekkäin, tietokone voi tulkita sormet yhdeksi sormeksi. Voit vierittää kahdella sormella käyttäen kosketuslevyä. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. Valitse Kosketuslevy-kohdasta valinta Kahden sormen vieritys. When this is selected, tapping and dragging with one finger will work as\nnormal, but if you drag two fingers across any part of the touchpad, it will\nscroll instead. If you also select Enable horizontal scrolling, you\ncan move your fingers left and right to scroll horizontally. Be careful to space\nyour fingers a bit apart. If your fingers are too close together, they just look\nlike one big finger to your touchpad. Kahden sormen vieritys ei välttämättä toimi kaikilla kosketuslevyillä. You can drag content as if sliding a physical piece of paper using the\ntouchpad. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. In the Touchpad section, check\n   Content sticks to fingers. This feature is also known as Natural Scrolling or\nReverse Scrolling.", " Jos teit videon Linux-tietokoneella ja lähetit sen Windows- tai Mac OS X -käyttäjälle, vastaanottajalla saattaa ilmetä ongelmia videoa toistaessa. Jotta vastaanottaja voi katsoa lähettämäsi videon, hänen tietokoneellaan tulee olla soveltuva koodekki asennettuna. Koodekki on ohjelmisto, joka tietää kuinka tietynlaista videota tulee käsitellä. Videomuotoja on lukuisia, ja jokainen videomuoto vaatii oman koodekkinsa. Voit tarkistaa videosi muodon seuraavasti: Avaa tiedostonhallinta. Napsauta hiiren oikealla painikkeella videotiedostoa ja valitse valikosta Ominaisuudet. Mene Ääni/kuva-välilehdelle ja katso, mikä koodekki on listattu Video-osioon. Varmista videon toistoa yrittävältä henkilöltä, että tarvittavat purkuohjelmat on asennettu. Toisinaan saattaa olla tarpeen hakea internetistä apua purkuohjelman ja käytettävän videosovelluksen nimellä. Jos videossa on käytössä esimerkiksi Theora-videomuoto ja käytössä on Windows Media Player, haku ehdoilla \"theora windows media player\" löytänee tarvittavan purkuohjelman. Jos oikea purkuohjelma puuttuu, tarvittavan purkuohjelman lataus on lähes aina ilmaista ja asennus pakollista videon toistamiseksi. If you can't find the right codec, try the\n VLC media player. It works on\n Windows and Mac OS as well as Linux, and supports a lot of different video\n formats. Otherwise, try converting your video into a different format. Most\n video editors are able to do this, and specific video converter applications are\n available. Check Ubuntu Software to see what's available. On olemassa myös muutama muu ongelma, joista johtuen videoiden katselu ei ole mahdollista. Video voi olla vaurioitunut lähetysvaiheessa (joskus suuret tiedostot eivät kopioidu kunnolla), vastapuolella voi olla ongelmia oman videotoistoon käytettävän ohjelman kanssa tai videota ei ole luotu oikealla tavalla (videon tallennusprosessissa on saattanut tapahtua virheitä).", " Väriprofiili on kokoelma dataa, joka karakterisoi joko laitteen kuten projektori tai väriavaruuden kuten sRGB. Useimmat väriprofiilit ovat ICC-profiileja, jotka ovat kooltaan pieniä tiedostoja ja tiedostopäätteeltään joko .ICC tai .ICM Väriprofiileja on mahdollista sisällyttää kuvatiedostoihin, jolloin ne ilmaisevat kuvan sävyntoistoalan. Näin taataan, että käyttäjä näkee samat värisävyt eri laitteilla. Jokaisella värejä käsittelevällä laitteella tulisi olla oma ICC-profiili, ja tämän tapahtuessa järjestelmällä sanotaan olevan päästä päähän -värihallittu työnkulku. Tällaisella työnkululla voidaan varmistua, että värejä ei hukata tai muokata.", " Profiili on mahdollista tuoda kaksoisnapsauttamalla .ICC- tai .ICM-päätteistä tiedostoa tiedostonhallinnassa. Vaihtoehtoisesti voit valita Tuo profiili… kohdasta Järjestelmäasetukset ▸ Värit valitessasi profiilia laitteelle.", " DVD-tukea ei voida toimittaa Ubuntun mukana oikeudellisten ja teknisten rajoitusten vuoksi. Useimmat kaupalliset DVD-levyt ovat salattuja ja vaativat salauksenpurkuohjelmiston niiden toistamiseksi. Voit ostaa kaupallisen DVD-levyjen salauksenpurkuohjelmiston Fluendolta. Se toimii normaalisti Linuxin kanssa ja sen pitäisi olla laillinen kaikissa maissa. Fluendon salauksenpurkuohjelmisto on myytävänä Ubuntun sovellusvalikoimassa. Joissain maissa kopiointisuojausten ohittaminen ei ole sallittua. Suomessa tällaisten ohjelmistojen asennus ja käyttö on sallittua, mutta levitys ei. Varmista muissa maissa ennen suojauksen ohitusta toimenpiteen laillisuus. Install libdvdnav4, libdvdread4,\ngstreamer1.0-plugins-bad, gstreamer1.0-plugins-ugly, and libdvd-pkg. Open the Dash and launch a Terminal. Run the command sudo dpkg-reconfigure libdvd-pkg and confirm in order to install libdvdcss2.", " Oletuksena Ubuntu näyttää vain kellonajan kellossa. Voit halutessasi asettaa kellon näyttämään lisätietoja. Napsauta kelloa ja valitse Ajan ja päiväyksen asetukset. Vaihda Kello-välilehdelle. Valitse näytettävät ajan ja päivän valinnat. Voit myös poistaa kellon näkyvistä poistamalla valinnan kohdasta Näytä kello paneelissa. Jos muutat mielesi, saat kellon takaisin napsauttamalla näytön oikeassa yläkulmassa olevaa kuvaketta ja valitsemalla Järjestelmäasetukset. Kellon asetukset löytyvät valitsemalla Aika ja päiväys Järjestelmä-osiosta. Voit myös vaihtaa kellon päiväyksen näyttötapaa vastaamaan asuinpaikkasi muotoilua. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Kieliasetukset Henkilökohtaiset-osiosta. Valitse Alueelliset muotoilut -välilehti. Valitse haluamasi alueellinen muotoilu pudotusvalikosta. Muutokset astuvat voimaan seuraavan sisäänkirjautumisen yhteydessä.", " Jos valikkopalkissa näkyvä päivä ja aika ovat väärin tai ne näkyvät väärässä esitysmuodossa, voit vaikuttaa asiaan seuraavasti: Muuta aikaa tai päiväystä napsauttamalla kelloa valikkopalkista ja valitsemalla Ajan ja päiväyksen asetukset. Vaihda järjestelmän aikavyöhykettä napsauttamalla haluamaasi vyöhykettä kartalta tai kirjoittamalla kaupungin nimen Sijainti-kenttään. Oletuksena Ubuntu synkronoi kellonajan internetissä olevan aikapalvelimen kanssa, joten kellonajan asettaminen käsin ei yleensä ole tarpeen.", " Vain tiettyjen asiankirjan sivujen tulostaminen: Napsauta Tiedosto ▸ Tulosta Valitse Tulosta-ikkunan Yleiset-välilehdellä Alue ja kopiot-kohdasta valinta Sivut. Kirjoita haluamasi sivut pilkuin eroteltuna tekstikenttään. Valitse useamman sivun sivualue käyttämällä viivaa \"-\". Kun kirjoitat \"1,3,5-7,9\" Sivut-kenttään, tulostetaan sivut 1,3,5,6,7 ja 9.", " Kun olet valmis lopettamaan tietokoneen käytön, voit sammuttaa sen, asettaa tietokoneen valmiustilaan virran säästämiseksi tai pelkästään kirjautua ulos. Jos haluat muiden henkilöiden pitäisi päästä käyttämään tietokonetta, voit kirjautua ulos tai vaihtaa käyttäjää. Jos vaihdat käyttäjää, kaikki käynnissä olevat sovellukset ovat edelleen käynnissä, kun kirjaudut takaisin sisään. Kirjaudu ulos tai vaihda käyttäjää napsauttamalla järjestelmävalikkoa näytön oikeassa yläkulmassa ja valitsemalla haluamasi vaihtoehto. Jos poistut tietokoneelta hetkeksi, estä muita henkilöitä käyttämästä tiedostojasi ja sovelluksiasi lukitsemalla näyttö. Kun palaat, kirjaudu takaisin sisään antamalla salasanasi. Jos et lukitse näyttöä itse, se lukitaan automaattisesti tietyn ajan kuluttua. Lukitse näyttö napsauttamalla ensin  järjestelmävalikkoa ja valitsemalla sitten Lukitse. Kun näyttö on lukittu, muut käyttäjät voivat kirjautua omilla tunnuksillaan sisään napsauttamalla Vaihda käyttäjää. Voit jatkaa työskentelyä omassa istunnossasi myöhemmin. Säästä sähköä laittamalla tietokoneesi valmiustilaan, kun et käytä sitä. Jos käytössäsi on kannettava tietokone, Ubuntu siirtyy valmiustilaan kun kansi suljetaan. Valmiustila tallentaa tietokoneen tilan muistiin ja sammuttaa suurimman osan tietokoneen toiminnoista. Valmiustila kuluttaa kuitenkin jonkin verran sähköä, mutta kulutus on hyvin alhainen verrattuna koneen päällä pitämiseen. Aseta tietokone valmiustilaan valitsemalla järjestelmävalikosta Valmiustila. Jos haluat sammuttaa tai käynnistää tietokoneen uudelleen, avaa järjestelmävalikko ja napsauta Sammuta... Jos muita käyttäjiä on kirjautuneena sisään, et ehkä voi sammuttaa tai käynnistää tietokonetta uudelleen. Ylläpitäjät voivat sammuttaa tietokoneen salasanallaan.", " Ubuntuun sisältyy Unity-vierityspalkit, jotka vievät perinteisiä vierityspalkkeja vähemmän tilaa. Vaikka ne ovat saaneet vaikutteita mobiililaitteista, joissa perinteisiä vierityspalkkeja ei tarvita, toimivat Ubuntun vierityspalkit hyvin myös hiirellä. Jotkin sovellukset, kuten Firefox ja Libreoffice, eivät vielä tue uusia vierityspalkkeja. Unity-vierityspalkit ovat vieritettävän alueen reunassa näkyvät oranssit raidat. Vierityspalkin sijainti vastaa näytön näkymän sijaintia vieritettävän sisällön suhteen. Vierityspalkin raidan pituus on verrannollinen sisällön määrään. Kun sisältöä on paljon, vierityspalkin raita on lyhyt. Siirrä hiiren osoitin mihin tahansa kohtaan laidassa, niin vierityspalkki ilmestyy esiin. Vedä vierityspalkkia ylös tai alas asettaaksesi sijainnin haluamaasi kohtaan. \n    Click the scrollbar to move the screen's position exactly where you want it.\n    ", " Lue kohdekuva tiedostoksi kuvanlukijalla ja tallenna se pakkaamattomana TIFF-tiedostona. Sitten voit napsauttaa Kalibroi…-painiketta Järjestelmäasetukset ▸ Värit -ikkunassa luodaksesi laitteelle profiilin. Kuvanlukulaitteet eivät juurikaan ikäänny, eivätkä ne yleensä vaadi kalibrointia uudelleen.", " Voit valita ja vetää yksinkertaisesti liikuttamalla hiiren osoittimen ohjaus- tai objektiruutuun. Tämä on käytännöllinen jos sinulla on vaikeuksia liikuttaa ja napsauttaa hiirtä samaan aikaan. Tätä ominaisuutta kutsutaan \"napsautus kohdistamalla\" tai \"viipyvä napsautus\". Kun napsautus kohdistamalla on käytössä, voit siirtää hiiren osoittimen painikkeen päälle, pitää hiiren hetken paikallaan ja odottaa, kunnes painikkeen napsautus tapahtuu. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Esteettömyys ja valitse Osoittaminen ja napsauttaminen -välilehti. Kytke Napsautus kohdistamalla päälle. Napsautus kohdistamalla -ikkuna aukeaa ja pysyy kaikkien muiden ikkunoiden yläpuolella. Voit käyttää tätä valitaksesi, minkälainen napsautus tulisi tapahtua kohdistamalla hiiren osoittimen painikkeen päälle. Jos esimerkiksi valitset Kakkosnapsautuksen, kohdistus simuloi hiiren kakkospainikkeen napsautusta kohdistamalla hiiren osoittimen painikkeeseen muutamaksi sekunniksi. Erikoistoiminnon jälkeen palaudutaan tavalliseen tilaan. Kun siirrät hiiren osoittimen painikkeen päälle ja et siirrä osoitinta, alkaa painikkeen väri hiljalleen muuttua. Kun väri on vaihtunut kokonaan, painike aktivoituu. Käytä Viiveen kesto -liukusäädintä hallitaksesi aikaa, kuinka kauan hiirta tulee pitää paikallaan ennnen napsautusta. Sinun ei tarvitse pitää hiirtä täysin paikallaan kohdistaessasi painikkeeseen - osoitin saa liikkua hivenen ja napsautus tapahtuu. Jos osoitin kuitenkin liikkuu liikaa, napsautusta ei tapahdu. Säädä Liikekynnys-asetusta, muuttaaksesi kuinka paljon osoitin voi liikkua ja silti sen katsotaan olevan paikallaan.", " Jos haluat käyttää toista näyttöä pöytäkoneessasi, liitä se tietokoneeseen. Jos järjestelmä ei tunnista näyttöä automaattisesti, tai jos haluat muokata asetuksia: Napsauta nimeäsi valikkopalkissa ja valitse Järjestelmäasetukset. Avaa Näytöt. Napsauta näyttöä, jonka tilaa haluat muokata ja laita se Päälle/Pois. Näyttö, jossa valikkopalkki sijaitsee, on ensisijainen näyttö. Jos haluat muuttaa ensisijaista näyttöä, napsauta kyseistä palkkia ja raahaa se siihen näyttöön, jota haluat käyttää ensisijaisena. Napsauta ja vedä näyttöä, jotta voit siirtää sen \"sijainnin\" haluamaasi paikkaan. Jos haluat molempien näyttöjen näyttävän saman sisällön, rastita Peilaa näytöt -valintaruutu. Kun olet tyytyväinen asetuksiin, napsauta Toteuta ja tämän jälkeen Säilytä nämä asetukset. Sulje Näytöt napsauttamalla x yläkulmasta.", " Voit valita tiedostoja käyttäen lauseketta, joka löytyy tiedostonimestä. Paina Ctrl+S avataksesi Valitse täsmäävät kohteet -ikkunan. Kirjoita lauseke käyttäen tiedostojen nimien yhteisiä osia ja jokerimerkkejä. Käytettävissä on kaksi jokerimerkkiä: * vastaa mitä tahansa merkkien määrää (myös tyhjää!). ? vastaa tarkalleen yhtä mitä tahansa merkkiä. Esimerkiksi: Jos sinulla on OpenDocument-tekstitiedosto, PDF-tiedosto ja kuva, joilla on sama perusnimi Lasku, valitse ne kaikki lausekkeella Lasku.* Jos sinulla on kuvia, joiden nimet ovat Loma-001.jpg, Loma-002.jpg ja Loma-003.jpg, voit valita ne lausekkeella Loma-???.jpg Jos sinulla on kuvia (kuten edellä) mutta olet muokannut osaa niistä ja lisännyt -muokattu tiedoston nimen loppuun, voit valita kuvat lausekkeella Loma-???-muokattu.jpg", " Joidenkin tietokoneiden käyttöaika akulla saattaa lyhetä Linuxia käytettäessä, vaikka entisessä Windowsissa tai Mac OS X:ssä akku kestää pidempään. Tämä johtuu yleensä siitä, että tietokonevalmistaja on todennäköisesti asentanut Windowsiin/Maciin virranhallintaa parantavia ohjelmistoja tai laitteita. Ne ovat yleensä niin käyttöjärjestelmäkohtaisia, että niiden integroiminen myös Linuxiin ei ole järkevää. Valitettavasti näiden ongelmien korjaaminen ainakaan helposti ei ole mahdollista, ellet tarkalleen tiedä mistä ne johtuvat. Yleiset virransäästövinkit voivat auttaa. Lisäksi jos tietokoneen suorittimen nopeutta voi muuttaa, sitä kannattaa kokeilla. Yksi syy akun keston arvion epäjohdonmukaisuuteen on se, että arviointitapa on erilainen Windowsin, Mac OS X:n ja Linuxin välillä. Akun kesto saattaa olla kaikissa sama, mutta eri arviointitavat antavat vaihtelevia arvoja.", " Langattoman verkon puuttumiseen valikkopalkin kautta avattavasta verkkovalikosta on monia mahdollisia syitä. Jos listalla ei ole yhtään verkkoa, langaton verkkokortti voi olla pois päältä tai tai ei välttämättä toimi oikein. Varmista että WLAN-vastaanotin on päällä. Tämä tehdään yleensä laitteessa olevasta painikkeesta. Jos alueella on paljon langattomia verkkoja, etsimäsi ei ehkä mahdu ensimmäiselle sivulle. Jos näin on, tutkaile listaa joka avautuu viemällä hiiren oikealle osoittavan nuolen päälle ja valitse langaton verkko listasta. Saatat olla verkon kantomatkan ulottumattomissa. Siirry lähemmäksi tukiasemaa ja tarkista hetken kuluttua, ilmestyykö verkon nimi luetteloon. Langattomien verkkojen saatavuuden päivittäminen vie jonkin aikaa. Jos tietokone on juuri käynnistetty tai siirretty toiseen paikkaan, odota hetki ja tarkista tilanne uudelleen. Verkko saattaa olla piilotettu. Piilotettuun verkkoon yhdistetään eri tavalla.", " Voit määrittää, mitkä sovellukset käynnistetään automaattisesti sisäänkirjautumisen yhteydessä oletuskäynnistyssovellusten lisäksi. Use the Dash to find and open\n      Startup Applications. Alternatively you can press\n      Alt+F2 and run the\n      gnome-session-properties command. Click Add and enter the command to be executed at login\n      (name and comment are optional). For example, to make Firefox start\n      automatically, it's sufficient to type firefox in the\n      Command field and confirm with Add. You can either type the command, or click the Browse...\n    button and select a command. Applications to autostart are typically\n    located in the /usr/bin folder.", " Näytön kirkkauden säätäminen säästää virtaa ja helpottaa lukemista kirkkaissa olosuhteissa. Näyttö voidaan myös asettaa himmenemään automaattisesti akkukäytössä ja sammumaan ellei sitä käytetä. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Kirkkaus ja lukitus. Siirrä Kirkkaus-liukusäädintä sopivaan kohtaan. Useissa kannettavissa on erikoisnäppäimet näytön kirkkauden säätämiseen. Näissä näppäimissä on yleensä auringon kuva ja ne sijaitsevat toimintonäppäinten alaisina näppäimistön yläreunassa. Fn-näppäin tulee pitää pohjassa näitä näppäimiä käytettäessä. Akkukäytön virrankulutusta voi vähentää automaattisesti valitsemalla Himmennä näyttöä säästääksesi virtaa. Näytön taustavalo voi kuluttaa paljon virtaa ja lyhentää akkusi kestoa. Näyttö sammutetaan automaattisesti, jos et käytä sitä hetkeen. Tämä vaikuttaa vain näyttöön eikä sammuta tietokonetta. Voit säätää näytön sammuttamisen viivettä valitsemalla sopiva aikamäärä Sammuta näyttön koneen ollessa käyttämättä -valinnalla.", " Yleensä tulostimet tulostavat ensimmäisen sivun ensin ja viimeisen sivun lopuksi. Tällöin sivut saattavat tulostua päinvastaiseen järjestykseen, kuin mitä oli tarkoitus tulostaa. Voit kuitenkin vaihtaa tulostusjärjestystä. Vaihtaaksesi järjestystä: Napsauta Tiedosto ▸ Tulosta. Valitse Käänteinen tulostusikkunan Yleiset-välilehden Kopioita-kohdasta. Näin viimeinen sivu tulostetaan ensin ja niin edelleen. Jos olet aikeissa tulostaa enemmän kuin yhden kopion asiakirjasta, tulosteet järjestetään oletuksena sivunumeroiden mukaisesti, eli ensimmäisen sivun kopiot ensin, sitten toisen sivun kopiot jne. Jos haluat järjestää asiakirjat siten, että sivunumerot seuraavat toisiaan kopioittain, valitse Kerää. Kootaksesi: Napsauta Tiedosto ▸ Tulosta. Valitse Kerää tulostusikkunan Yleiset-välilehden Kopioita-kohdasta.", " TIetokoneesi kykenee tunnistamaan useita erilaisia tulostimia, kun tulostin kytketään tietokoneeseen. Useimmat tulostimet yhdistetään tietokoneeseen USB-johdon avulla. Valintaa paikallisen ja verkkotulostimen asennuksen välillä ei tarvitse tehdä. Kaikki tulostimet esitetään yhdessä ikkunassa. Varmista että tulostin on päällä. Liitä tulostin tietokoneeseen sopivalla kaapelilla. Tietokoneen näytöllä saattaa näkyä toimintaa, kun tietokone etsii sopivia ajureita. Tulostinajurien asennus saattaa vaatia salasanan syöttämisen. Näytölle ilmestyy viesti, kun tulostin on asennettu järjestelmään. Valitse Tulosta testisivu tulostaaksesi testisivun, tai Valinnat tehdäksesi muutoksia tulostimen asetuksiin. Jos tulostintasi ei havaittu ja sen asetuksia tehty automaattisesti, voit lisätä tulostimen itse tulostinasetuksista. Napsauta kuvaketta aivan valikkopalkin oikeassa reunassa ja valitse Järjestelmäasetukset. Avaa Tulostimet. Napsauta Lisää ja valitse tulostin Laitteet-ikkunasta. Napsauta Seuraava ja odota, kun ajureita etsitään. Voit halutessasi muuttaa tulostimen nimeä, kuvausta ja sijaintia. Kun kaikki on valmista, napsauta Toteuta. Voit nyt tulostaa testisivun tai napsauttaa Peru ohittaaksesi tämän vaiheen. Jos tietokoneellesi on saatavilla useita ajureita, sinua saatetaan pyytää valitsemaan sopiva ajuri. Napsauta Seuraava valmistaja- ja malli-vaiheissa, jolloin koneesi käyttää suositeltua ajuria. Tulostimen asennuksen jälkeen saatat haluta vaihtaa oletustulostinta.", " Voit käyttää ulkoista mikrofonia esimerkiksi puhelun soittamista varten. Vaikka tietokoneessasi olisi sisäänrakennettu mikrofoni, erillinen mikrofoni voi tarjota paremman äänenlaadun. Jos mikrofonin liitin on pyöreä, ohut ja melko pitkä, kytke se se sopivaan liitäntään tietokoneeseen. Useimmissa tietokoneissa on kaksi tai kolme tällaista liitintä: yksi kaiuttimille/kuulokkeille ja toinen mikrofonille. Yritä etsiä liittimien vierestä mikrofonin kuvaketta. Mikrofonin liitintä korostetaan yleensä vaaleanpunaisella värillä, kun taas kuulokkeita vihreällä. Kun mikrofoni on kytketty tähän liittimeen, se otetaan yleensä käyttöön automaattisesti. Jos mikrofoni ei kuitenkaan ala toimimaan automaattisesti, lue alapuolelta lisäohjeita. USB-mikrofoni kytketään tietokoneen USB-porttiin. USB-mikrofonit näkyvät erillisinä äänilaitteina, joten oletusmikrofonin saattaa joutua määrittämään ääniasetuksista. Avaa äänivalikko valikkopalkista ja napsauta Ääniasetukset. Sisääntulo-välilehdellä valitse haluamasi tallennuslaite luettelosta. Tarkista mikrofonin toimivuus Äänitystason palkeista.", " Jos hiiren tai jonkin muun osoitinlaitteen käyttäminen tuntuu hankalalta, voit hallita hiiren osoitinta käyttämällä näppäimistösi numeronäppäimistöä. Tätä ominaisuutta kutsutaan hiirinäppäimiksi. Napauta Super-näppäintä avataksesi Unity-valikon. Avaa esteettömyysasetukset kirjoittamalla Esteettömyys ja painamalla Enter. Paina Tab-näppäintä kerran valitaksesi Näkeminen-välilehden. Paina ← kerran siirtyäksesi Kohdistaminen ja napsauttaminen -välilehdelle. Paina ↓ kerran valitaksesi Hiirinäppäimet-tilavalitsimen ja paina Enter ottaaksesi sen käyttöön. Varmista, että Num Lock on pois päältä. Voit nyt ohjata hiiren osoitinta näppäimistöä käyttäen. Nämä ohjeet tarjoavat lyhyimmän mahdollisen tavan ottaa hiirinäppäimet käyttöön pelkkää näppäimistöä käyttämällä. Valitse Esteettömyysasetukset käyttääksesi muita esteettömyysominaisuuksia. Numeronäppäimistö on ryhmä numeerisia neliön muotoon aseteltuja näppäimiä. Jos erillistä numeronäppäimistöä ei löydy (kuten joissain kannettavissa tietokoneissa), numeronäppäimistö on asetettu toisten näppäinten alle ja niitä voidaan käyttää pitämällä toimintonäppäintä (Fn) pohjassa. Jos käytät tätä ominaisuutta useasti eikä näppäimistöstä löydy numeronäppäimistöä, voit ostaa erillisen USB-liitännällä toimivan numeronäppäimistön. Jokainen numeronäppäimistön näppäin vastaa tiettyä liikesuuntaa. Esimerkiksi 8 siirtää hiirtä ylöspäin ja 2 alaspäin. Numeron 5 painallus vastaa hiiren napsautusta ja nopeasti kahteen kertaan painettuna kaksoisnapsautusta. Useimmilta näppäimistöiltä löytyy välilyönnin läheltä erikoisnäppäin, joka simuloi hiiren oikean painikkeen napsautusta. Huomaa kuitenkin, että tämä näppäin simuloi hiiren oikean painikkeen painallusta kohteeseen, johon näppäimistö on kohdistettu eikä hiiren osoittimen kohtaan. Lue Simuloi hiiren oikean napin painallusta saadaksesi tietoa, miten hiiren oikean painikkeen napsautuksen simulointi onnistuu pitämällä 5-näppäintä tai hiiren vasenta painiketta pohjassa. Jos haluat käyttää numeronäppäimistöä numeroiden kirjoittamiseen hiirinäppäinten ollessa käytössä, aseta NumLock päälle. Hiiren ohjaaminen näppäimistöllä ei kuitenkaan onnistu samanaikaisesti NumLockin ollessa päällä. Numeronäppäimet kirjaimien yläpuolella eivät hallitse osoitinta. Ainoastaan numeronäppäimiä voidaan tähän käyttää.", " Tietokonetta on mahdollista käyttää langattomana yhteyspisteenä (myös sanaa hotspot käytetään). Kun tietokone on yhteydessä Internetiin esimerkiksi Ethernet-kaapelin tai mobiiliyhteyden kautta, Internet-yhteys on mahdollista jakaa muiden laitteiden kanssa tietokoneen toimiessa langattomana yhteyspisteenä. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Verkko ja valitse Langaton vasemmalta. Napsauta Käytä yhteyspisteenä... Jos tietokone on jo yhteydessä langattomaan verkkoon, sinulta kysytään halutaanko kyseinen yhteys katkaista. Langaton verkkosovitin voi olla samanaikaisesti yhteydessä vain yhteen langattomaan verkkoon. Napsauta Luo yhteyspiste. Verkon nimi (SSID) ja turvallisuusavain luodaan automaattisesti. Verkon nimi pohjautuu tietokoneen nimeen. Näitä tietoja tarvitaan laitteella, joka yhdistetään Internetiin yhteyspisteen avulla.", " Tietokoneet kuluttavat paljon virtaa. Muutamilla yksinkertaisilla virransäästövinkeillä pienennät sähkölaskusi ja autat ympäristöä. Jos käytät kannettavaa, nämä vinkit kasvattavat akun kestoa. Aseta tietokone valmiustilaan kun et käytä sitä. Koneen virrankulutus vähenee huomattavasti, mutta kone käynnistyy silti nopeasti. Sammuta tietokone, jos olet käyttämättä sitä pidemmän aikaa. Tietokoneen käyttöikä ei laske, vaikka se sammutettaisiin ja käynnistettäisiin uudelleen usein. Käytä Virransäästöasetuksia Järjestelmäasetuksista tietokoneen energiankulutuksen vähentämiseen. Tarjolla on useita virtaa säästäviä vaihtoehtoja: näyttöä voidaan automaattisesti himmentää tietynmittaisen epäaktiivisuuden jälkeen, kannettavan näytön oletuskirkkautta voidaan vähentää ja tietokone voi siirtyä valmiustilaan automaattisesti, jos se on ollut joutilaana tietyn aikaa. Sammuta erilliset laitteet (kuten tulostimet ja kuvanlukijat), kun et käytä niitä. Himmennä näyttöä; merkittävä osa kannettavan virrasta kuluu näyttöön. Useimpien kannettavien näppäimistöissä on valoisuuden säätöä varten omat näppäimet (tai pikanäppäimet). Jos et tarvitse internetyhteyttä hetkeen, sammuta langaton verkkokortti ja Bluetooth-yhteys. Näiden laitteiden radioaaltoihin pohjautuva toiminta kuluttaa akkua. Joistain koneista löytyy kytkin Internet-yhteyden sammuttamiseen kun taas toisissa koneissa Internet-yhteys sammutetaan näppäimistön avulla. Käynnistä Internet-yhteys tarvittaessa uudelleen. Vähennä taustalla pyörivien tehtävien määrää. Tietokoneet käyttävät sitä enemmän virtaa, mitä enemmän tehtäviä niillä on hoidettavana. Useimmat ohjelmat eivät käytä tietokoneen resursseja, jos niitä ei käytetä aktiivisesti. Usein tietoa internetistä hakevat sekä musiikkia tai elokuvia toistavat ohjelmat voivat kuitenkin vaikuttaa tietokoneen virrankulutukseen.", " Kaksoisnapsautus tapahtuu, kun painat hiiren painiketta kahdesti tarpeeksi nopeasti. Jos toinen painallus suoritetaan liian hitaasti, kaksoisnapsautuksen sijasta suoritetaan kaksi normaalia napsautusta. Jos kaksoisnapsautuksen toteuttaminen on vaikeaa, kannattaa kaksoisnapsautuksen aikarajaa kasvattaa. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. Under General, adjust the Double-click\n  slider to a value you find comfortable. Click the Test Your Settings button to test. A single\n  click in the window will highlight the outer circle. A double-click will\n  highlight the inside circle. Jos hiiresi suorittaa kaksoisnapsautuksen, kun haluat napsauttaa vain kerran ja olet kasvattanut kaksoisnapsautuksen aikarajaa, hiiri voi olla viallinen. Voit tutkia ongelman lähdettä liittämällä toisen hiiren koneeseesi ja kokeilemalla sen toimintaa. Ongelmia aiheuttavan hiiren toimintaa kannattaa kokeilla myös toisella koneella. Tämä asetus vaikuttaa hiireen, kosketuslevyyn ja kaikkiin muihin osoitinlaitteisiin.", " Tuo käynnistin esiin siirtämällä hiiri näytön vasempaan ylälaitaan. Käynnissä olevien sovellusten kuvakkeiden vasemmalla puolella on pieni valkoinen kolmio. Vaihda toiseen sovellukseen napsauttamalla sen kuvaketta. Jos samasta ohjelmasta on avattu useampi ikkuna, kolmioita näytetään saman verran kuin ikkunoita on auki. Napsauta sovelluksen kuvaketta, jolloin avautuu Ikkunat-näkymä, jossa näytetään kaikki ohjelman ikkunoiden pikkukuvat. Paina Alt+Tab käynnistääksesi ikkunanvaihtajan. Vapauta Alt valitaksesi seuraavan (korostetun) ikkunan vaihtajasta. Voit selata avoimia ikkunoita pitämällä Alt-näppäimen pohjassa ja painamalla Tab (siirtyy seuraavaan ikkunaan) tai Vaihto+Tab (siirtyy edelliseen ikkunaan). Ikkunanvaihtajan ikkunat ovat ryhmitelty ohjelmittain. Jos ohjelmalla on useita ikkunoita, ikkunoiden esikatselut esitetään selatessasi ikkunaluetteloa. Ohjelmien välillä liikkuminen onnistuu myös nuolinäppäimillä → ja ← tai valitsemalla se hiirellä. Jos ohjelmalla on vain yksi ikkuna, ikkunan esikatselu avautuu ↓-näppäimellä. Vain nykyisessä työtilassa olevat ikkunat näytetään. Nähdäksesi ikkunat kaikista työtiloista, pidä pohjassa Ctrl ja Alt ja paina sitten Tab tai Shift+Tab. Super+W -näppäinyhdistelmä näyttää kaikki avoimet ikkunat samanaikaisesti. Napsauta ikkunaa, johon haluat vaihtaa.", " Jos hiiren osoitin liikkuu liian nopeasti, kun liikutat hiirtä tai käytät kosketuslevyä, voit asettaa osoittimen nopeuden haluamallesi tasolle. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Hiiri ja kosketuslevy. Siirrä Osoittimen nopeus -liukusäädin sellaiseen asentoon, että osoittimen nopeus miellyttää sinua. You can set the pointer speed differently for your mouse\n  and touchpad. Sometimes the most comfortable settings for one type of\n  device aren't the most comfortable for another. Just set the sliders on\n  both the Mouse and Touchpad sections. Kosketuslevy-osio näkyy vain, jos tietokoneessasi on kosketuslevy.", " Se, kuinka usein varmuuskopioita on syytä ottaa, riippuu järjestelmästä. Esimerkiksi jokaöiset varmuuskopioit eivät välttämättä ole tarpeeksi kriittistä dataa sisältävälle verkkopalvelimelle. Toisaalta kotikoneella olevien tiedostojen varmuuskopiointi tunnin välein voi olla tarpeetonta. Seuraavia asioita kannattaa huomioida varmuuskopiointiaikataulun suunnittelussa: Kuinka paljon aikaa vietät tietokoneen ääressä? Kuinka usein muutat työtiedostoja ja kuinka paljon niitä on? Jos varmuuskopioitavat tiedostot eivät ole kovin tärkeitä tai muuttuvat harvoin (kuten musiikki, sähköpostit ja valokuvat), viikoittainen tai jopa kuukausittainen varmuuskopiointi on hyvä valinta. Tiheämpi varmuuskopiointiaikataulu voi kuitenkin joissain tapauksissa olla tarpeellinen. Nyrkkisääntönä voidaan pitää sitä, että varmuuskopioiden luomisen väliin jäävä aika ei ole pidempi kuin aika, jonka olet valmis käyttämään kadonneiden tiedostojen uudelleenluomiseen. Jos kadonneiden asiakirjojen uudelleenkirjoittamiseen kuluva viikko tuntuu liian pitkältä ajalta, varmuuskopiot kannattaa luoda viikoittain.", " Voit käyttää työpöytää ja sovelluksia lukuisilla eri kielillä kunhan tietokoneelle on asennettu kielipaketteja. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Napsauta Kieliasetukset. Valitse ensisijainen käyttökielesi Kieli-välilehdellä. Vedä kielet haluamaasi järjestykseen niin, että suosikkisi on ylimpänä. Muutokset astuvat voimaan kirjautuessasi sisään uudelleen. Kirjaudu ulos napsauttamalla kuvaketta oikeassa yläkulmassa ja valitse Kirjaudu ulos.. Käännökset voivat kielestä riippuen olla puuttellisia ja sisältää virheitä, eivätkä kaikki sovellukset välttämättä tue lainkaan käyttämääsi kieltä. Suomen kielelle on Ubuntussa verrattain hyvä tuki, mutta sovelluksissa sen yleisyys vaihtelee. Kotikansiolla ja sen sisällä olevilla kansioilla (muun muassa Asiakirjat, Kuvat ja Musiikki) on kielikohtaiset nimet. Kun kirjaudut seuraavan kerran uudelleen sisään, sinulta kysytään, vaihdetaanko näiden kansioiden nimet uudelle kielelle vai säilytetäänkö vanhan kielen nimi. Nimet kannattaa vaihtaa uuteen kieleen, jos vaihdoit kieltäsi pidemmäksi aikaa. Kun vaihdat kieltä, muutos otetaan käyttöön vain tililläsi kirjautumisen jälkeen. Voit myös vaihtaa järjestelmän kieltä, jota käytetään mm. kirjautumisruudussa. Vaihda kieltä kuten yllä on kuvattu. Napsauta Toteuta järjestelmänlaajuisesti. Tarvitset ylläpitäjän oikeudet. Anna salasanasi tai pyydetyn ylläpitotilin salasana.", " Varmuuskopioinnin jälkeen on viisainta varmistaa, että varmuuskopiointi onnistui ja tiedostot ovat käytettävissä. Jos varmuuskopiointi ei onnistunut täysin, osa tärkeistä tiedostoista on saattanut jäädä pois varmuuskopiosta. Kun käytät tiedostonhallintaa kopioidaksesi tai siirtääksesi tiedostoja, tietokone varmistaa, että kaikki tieto siirtyi onnistuneesti. Jos siirrät tietoa, joka on hyvin tärkeää, saatat haluta suorittaa lisätarkistuksia vahvistaaksesi tiedon siirtyneen onnistuneesti. Voit suorittaa lisätarkastuksen selaamalla kopioidut tiedostot ja kansiot kohteessa. Tarkistamalla, että siirtämäsi tiedostot ja kansiot todellakin ovat varmuuskopiossa, varmistat, että prosessi onnistui. Jos huomaat varmuuskopioivasi säännöllisesti suuren määrän tietoa, lienee helpompaa käyttää varmuuskopiointiin tarkoitettua ohjelmaa, kuten Déjà Dupia. Varmuuskopio-ohjelma on monin tavoin kopiointia ja liittämistä parempi vaihtoehto.", " Valitettavasti laiteprofiilin tarkkuutta ei voi määrittää ilman uudelleenkalibrointia. Viimeisimpään kalibrointikertaan pohjautuen on kuitenkin mahdollista suositella uudelleenkalibrointia tietyn ajan jälkeen. Joillain yrityksillä on tiukat vaatimukset profiilien käyttöajan suhteen, koska epätarkka väriprofiili saattaa vaikuttaa suuresti lopputuotteeseen. Jos asetat vanhenemiskäytännön ja profiili on vanhempi kuin mitä käytännössä määritetään, Järjestelmäasetukset ▸ Väri -ikkunassa näytetään punainen varoitussymboli profiilin vieressä. Varoitusilmoitus näytetään myös joka kerta, kun kirjaudut tietokoneelle. Aseta näyttö- ja tulostinlaitteille käytäntö määrittämällä profiilin enimmäisikä päivissä:", " Verkkotilien tietoja on mahdollista hyödyntää erillisten sovellusten asetuksien määrittämistä varten. Evolution, sähköpostisovellus. Sähköpostitili lisätään Evolutioniin automaattisesti ja se kykenee hakemaan sähköpostin, yhteystiedot ja kalenterin sisällön Google-tililtäsi. Empathy-pikaviestin, pikaviestisovellus. Verkkotili lisätään ohjelmaan ja voit keskustella ystäviesi kanssa. Yhteystiedot mahdollistaa yhteystietojen lukemisen ja muokkaamisen. Asiakirjat-sovellus kykenee avaamaan verkkoasiakirjojasi. Empathy luo näiden tilien avulla yhteyden verkkoon ja mahdollistaa keskustelun ystävien, seuraajien ja osoitekirjasta löytyvien henkilöiden kanssa. Asiakirjat-sovellus kykenee avaamaan Microsoft SkyDriveen tallennettuja asiakirjoja. Kun Exchange-tili on luotu, Evolution kykenee lukemaan tilin viestejä. Kun ownCloud-tili on olemassa, Evolution pystyy lukemaan ja muokkaamaan yhteystietoja ja kalenterin tapahtumia. Tiedostot ja muut sovellukset voivat tutkia ja käsitellä ownCloudiin tallennettuja tiedostoja.", " Jos haluat tietää, mikä kellonaika eri kaupungeissa ympäri maailmaa on, voit lisätä useita aikavyöhykkeitä kellovalikkoon. Lisäämäsi kaupunkit näkyvät kalenterin alapuolella, kun napsautat kellovalikon auki. Napsauta kelloa ja valitse Ajan ja päiväyksen asetukset. Valitse Kello-välilehti ja napsauta valintaa Aika muissa sijainneissa. Napsauta Valitse sijainnit... Napsauta + lisätäksesi sijainnin. Täytä Sijainti-ruutu haluamasi kaupungin nimellä. Odota hetki ja lista mahdollisista kaupungeista ilmestyy. Valitse haluamasi sijainti, jolloin nykyinen aika kyseisessä sijainnissa täytetään automaattisesti. Napsauta - poistaaksesi sijainnin listasta. Voit myös vetää Sijainnit-ikkunassa sijainteja sellaiseen järjestykseen, missä haluat niiden näkyvän kellovalikossa.", " Kun poistut tietokoneelta hetkeksi, näyttö lukitaan automaattisesti. Jotta voit jatkaa työskentelyä, lukitus tulee avata antamalla salasana. Lukitus tehdään turvallisuussyistä, jotta kukaan ei pääse käyttämään tietokonetta käyttäjätililläsi. Automaattinen lukitus saattaa kuitenkin ärsyttää, jos näyttö lukitaan automaattisesti liian nopeasti. Näytön automaattisen lukituksen aikarajan kasvattaminen: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Napsauta Kirkkaus ja lukitus. Valitse haluamasi lukitusviive kohdasta Lukitse näyttö tietyn ajan jälkeen. Jos et halua käyttää näytön automaattista lukitusta, aseta kohta Lukitse pois päältä.", " Valmiustilaan asetettu tietokone käyttää erittäin vähän virtaa. Kaikki avoinna olevat sovellukset ja asiakirjat pysyvät avoinna, mutta näyttö ja mahdollisimman monet tietokoneen osat kytketään pois päältä. Tietokonetta ei kuitenkaan sammuteta, ja se käyttää jonkin verran virtaa. Voit palata valmiustilasta liikuttamalla hiirtä tai painamalla tietokoneen virtapainiketta. Joidenkin tietokoneiden laitteisto-ongelmista johtuen valmius- tai lepotila ei välttämättä toimi oikein.  Kannattaa siis kokeilla, miten oma tietokone toimii valmius- ja lepotiloissa. Tallenna kaikki työsi varmuuden varalta, ennen kuin asetat tietokoneen valmiustilaan. Näin työsi säilyvät, vaikka tietokone ei syystä tai toisesta käynnistyisi oikein.", " Toisinaan tulostimet syöttävät paperin väärin ja siten jumittuvat. Yleensä tulostimen käyttöohje opastaa, kuinka toimia paperin jumittuessa. Tyypillisesti tulostimen jokin paneeli tulee avata, etsiä paperitukos ja sitten kevyesti (ennen kaikkea varovasti!) poistaa jumittunut paperi. Kun tukos on poistettu, saattaa olla tarpeen painaa tulostimessa olevaa Jatka-painiketta. Jotkin tulostimet vaativat jopa tulostimen uudelleenkäynnistyksen, ennen kuin tulostustyötä voi jatkaa.", " Jos tulosteissa on raitoja, haalentuneita värejä tai muita ongelmia, syynä saattaa olla ongelma tulostimen kanssa tai loppumaisillaan oleva väri/muste. Haalistuva teksti tai kuva Tulostimen muste tai väriaine saattaa olla loppumaisillaan. Osta tarvittaessa lisää mustetta, väriainetta tai uusi mustekasetti. Raidat ja viivat Jos käytössäsi on mustesuihkutulostin, tulostimen tulostinpää saattaa olla likainen tai osittain jumissa. Yritä korjata ongelma puhdistamalla tulostinpää. Lisätietoja saat tulostimesi ohjekirjasta. Väärät värit Tulostimesta saattaa olla yksi muste tai väriaine loppu. Osta tarvittaessa lisää mustetta, väriainetta tai uusi mustekasetti. Epätasaiset viivat Jos tulosteissa olevissa suorissa viivoissa on katkelmia tai viivat ovat vinossa, saattaa olla tarpeen suoristaa tai puhdistaa tulostimen tulostinpää. Lisätietoja saat tulostimesi ohjekirjasta.", " Ulkoisen näytön käyttöönotto onnistuu yksinkertaisesti liittämällä näyttö tietokoneeseen. Jos järjestelmä ei tunnista näyttöä heti tai haluat muokata asetuksia: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Näytöt. Napsauta näyttöä, jonka tilaa haluat muokata ja laita se Päälle/Pois. Oletuksena käynnistin sijaitsee ensisijaisella näytöllä. Voit vaihtaa ensisijaista näyttöä  Käynnistimen sijainti -pudotusvalikosta. Vaihtoehtoisesti voi vetää käynnistimen esikatseluikkunassa haluamallesi näytölle. Jos haluat käynnistimen näkyvän kaikilla näytöillä, aseta Käynnistimen sijainti -kohtaan Kaikki näytöt. Napsauta ja vedä näyttöä, jotta voit siirtää sen \"sijainnin\" haluamaasi paikkaan. Jos haluat molempien näyttöjen näyttävän saman sisällön, rastita Peilaa näytöt -valintaruutu. Kun olet tyytyväinen asetuksiin, napsauta Toteuta ja tämän jälkeen Säilytä nämä asetukset. Sulje Näytöt napsauttamalla x yläkulmasta. Yleinen ongelma useita näyttöjä käytettäessä on hiiren karkaaminen vahingossa toiselle näytölle. Unityn Hidastus reunoilla -ominaisuus auttaa tähän ongelmaan törmänneitä, sillä sen ollessa käytössä hiiren siirtäminen näytöltä toiselle vaatii hiiren työntämistä reunaa vasten. Jos et pidä Hidastuksesta reunoilla, voit poistaa tämän ominaisuuden käytöstä.", " Jäljellä olevan musteen tai väriaineen määrän tarkistustapa riippuu tulostimen valmistajasta ja mallista, sekä tietokoneelle asennetuista ajureista ja sovelluksista. Joissain tulostimissa on oma näyttö, jonka kautta on mahdollista tarkistaa musteen määrä ja muita tietoja. Suurimmalle osalle HP-tulostimista on tarjolla HP Linux Imaging and Printing (HPLIP) -projektin ajurit sekä tarkistustyökalut. Muut tulostinvalmistajat saattavat tarjota suljettuja ajureita vastaavilla ominaisuuksilla. Vaihtoehtoisesti voit asentaa sovelluksen muste- ja väriainetason tarkkailuun ja tarkistamiseen. Inkblot näyttää musteen määrän HP:n, Epsonin ja Canonin tulostimille. Muistathan tarkistaa, että tulostimesi on tuettujen mallien luettelossa. Toinen vastaavanlainen sovellus Epsonin ja monien muiden valmistajien tulostimille on mktink. Jotkin tulostimet eivät toimi kunnolla Linuxilla, ja osa tulostimista ei anna millään käyttöjärjestelmällä tietoja musteen määrästä.", " Gnomen tiedostonhallinta mahdollistaa tiedostojen piilottamisen ja niiden näyttämisen tilanteen mukaan. Kun tiedosto on piilotettu, sitä ei oletuksena näytetä tiedostonhallinnassa, vaikka tiedosto onkin olemassa kansiossaan. Piilota tiedosto nimeämällä se uudelleen siten, että laitat . (pisteen) tiedoston nimen eteen. Jos esimerkiksi haluat piilottaa tiedoston esimerkki.txt, vaihda sen nimeksi .esimerkki.txt. Voit piilottaa kansioita samaan tapaan kuin tiedostoja. Lisää kansion nimen eteen . (piste). If you want to see all hidden files in a folder, go to that folder and\n  either click the \n  button in the toolbar and pick Show Hidden Files, or press\n  Ctrl+H. You will see all hidden files,\n  along with regular files that are not hidden. To hide these files again, either click the\n   button in the\n  toolbar and pick Show Hidden Files, or press\n  Ctrl+H again. To unhide a file, go to the folder containing the hidden file and click\n  the  button in the\n  toolbar and pick Show Hidden Files. Then, find the hidden file and\n  rename it so that it doesn't have a . in front of its name. For\n  example, to unhide a file called .example.txt, you should rename\n  it to example.txt. Once you have renamed the file, you can either click the\n   button\n  in the toolbar and pick Show Hidden Files, or press\n  Ctrl+H to hide any other hidden files\n  again. Piilotiedostot näytetään vain valitussa ikkunassa kunnes suljet sen. Näyttääksesi piilotiedostot kaikissa tiedostonhallinnan ikkunoissa, lue Views preferences in Files. Joillain piilotiedostoilla on nimen edessä piste (.), mutta osalla piilotiedostoista voi olla ~-merkki nimen lopussa (lue Miksi tiedoston nimen perässä on merkki \"~\"?).", " Voit käynnistää automaattisesti sovelluksen, kun liität tietyn laitteen. Saatat esimerkiksi haluta valokuvien hallinnan avautuvan, kun liität tietokoneeseen digitaalisen kameran. Voit myös estää sovelluksien käynnistymisen laitteita liittäessä. Määritä seuraavasti, miten toimitaan kun tietty laite liitetään tietokoneeseen: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Tiedot ▸ Erilliset tallennusvälineet. Find your desired device or media type, and then choose an application\n    or action for that media type. See below for a description of the different\n    types of devices and media. Instead of starting an application, you can also set it so that the device\n    will be shown in the file manager. When that happens, you will be asked\n    what to do, or nothing will happen automatically. Ohjelmisto-vaihtoehto eroaa hieman muista - jos kone havaitsee, että syöttämällesi levylle on asennettu ohjelmisto, voit yrittää käynnistää tämän ohjelman halutessasi automaattisesti. Tämä on hyvä, jos olet asentanut ohjelman CD:lle ja haluat sen käynnistyvän levyn käynnistyksen yhteydessä (esimerkiksi diaesitys) Jos laitetta tai mediatyyppiä ei löydy listasta (kuten Blu-ray-levyt tai e-kirjalukija), napsauta Muut mediat -painiketta. Avautuvasta ikkunasta löytyy kattavampi laitteiden ja sisältötyyppien lista. Valitse laitteen tai median tyyppi Tyyppi-pudotusvalikosta ja ohjelma tai toiminto Toiminto-pudotusvalikosta. Jos et halua mitään sovelluksia avattavan automaattisesti, kun koneeseen liitetään mikä tahansa laite, valitse Älä koskaan kysy tai käynnistä ohjelmia liitettäessä media. Choose your favorite music application or CD audio extractor to handle\n    audio CDs. If you use audio DVDs (DVD-A), select how to open them under\n    Other Media. If you open an audio disc with the file manager,\n    the tracks will appear as WAV files that you can play in any audio player\n    application. Choose your favorite video application to handle video DVDs. Use the\n    Other Media button to set an application for Blu-ray, HD DVD,\n    video CD (VCD), and super video CD (SVCD). If DVDs or other video discs\n    do not work correctly when you insert them, see Miksi DVD:t eivät toimi?.\n     Use the Other Media button to select a disc-writing\n    application for blank CDs, blank DVDs, blank Blu-ray discs, and blank HD\n    DVDs. Use the Photos drop-down to choose a photo-management\n    application to run when you plug in your digital camera, or when you insert\n    a media card from a camera, such as a CF, SD, MMC, or MS card. You can also\n    simply browse your photos using the file manager. Under Other Media, you can select an application to open Kodak\n    picture CDs, such as those you might have made in a store. These are regular\n    data CDs with JPEG images in a folder called PICTURES. Choose an application to manage the music library on your portable music\n    player, or manage the files yourself using the file manager. Use the Other Media button to choose an application to manage the\n    books on your e-book reader, or manage the files yourself using the file manager. Some discs and removable media contain software that is supposed to be run\n    automatically when the media is inserted. Use the Software option\n    to control what to do when media with autorun software is inserted. You will\n    always be prompted for a confirmation before software is run. Älä koskaan suorita ohjelmistoja medialta, johon et luota.", " Voit ottaa kuvan näytöstäsi (kuvakaappaus, screenshot). Siitä on hyötyä, kun haluat esimerkiksi näyttää jollekin miten jokin asia tehdään. Kuvakaappaukset ovat normaaleja kuvia, joten niitä voi lähettää niitä muille sähköpostilla tai jakaa verkossa. Kuvan ottaminen näytölläsi olevasta sisällöstä: Siirry Unity-valikkoon ja avaa Kuvakaappaus-sovellus. Valitse, haluatko ottaa kuvan koko työpöydästä, yhdestä ikkunasta vai näytön alueesta, Ota kuvankaappaus -ikkunasta. Aseta viive, jos haluat valita ikkunan tai muuten valmistella työpöydän kuvankaappausta varten. Voit myös halutessasi käyttää tehosteita. Napsauta Ota kuvakaappaus. Jos valitsit Valitse kaapattava alue, hiiren osoitin muuttuu ristin muotoiseksi. Napsauta kaapattavan alueen jotakin kulmaa ja vedä haluamasi alue. Poistu kaappaustilasta ja peru kuvakaappauksen ottaminen painamalla Esc. Anna tiedostonimi ja valitse tallennuskansio Tallenna kuvankaappaus -ikkunassa ja paina Tallenna.", " A built in calendar application called Calendar allows you to organize your calendar appointments or events. Up to five of these, over a four-week duration, will appear by clicking on the clock in the menu bar. Calendar appointment integration is also supported with a mail and calendar application called Evolution, which may be installed separately. Appointments and events may be managed through the built in Calendar application. Click on the Dash icon in the Launcher. Type calendar in the Search your computer to locate the Calendar application. Napsauta Kalenteri-sovelluksen kuvaketta. Alternatively, you may also type gnome-calendar in the Terminal application.", " Jos syötät koneeseen DVD-levyn, eikä tietokoneesi lue sitä, syinä voi olla puuttuva DVD-purkuohjelmisto (koodekki) tai DVD saattaa olla eri alueelta kuin mitä asemasi tukee. Useimpien kaupallisten DVD-elokuvien toistamista varten järjestelmässä on oltava asennettuna soveltuva purkuohjelmisto. Purkuohjelmisto mahdollistaa sovelluksen toistaa elokuvan ääntä ja kuvaa. Jos yrität toistaa DVD-levyn, eikä tietokoneellasi ole sopivaa purkuohjelmaa asennettuna, elokuvasoitin ilmoittaa virheestä ja opastaa purkuohjelman asennuksessa. DVD-elokuvat on usein myös kopiointisuojattu CSS-suojauksella. Se estää DVD-levyjen kopioinnin, mutta toisaalta se myös estää elokuvien toistamisen ilman ylimääräistä purkuohjelmistoa. Kaupallisissa DVD-elokuvissa on yleensä aluekoodi, joka määrittää mille maantieteellisille alueille elokuva on suunnattu. Usein DVD-asemat voivat toistaa vain samaa aluekoodia olevia levyjä. Jos käytössäsi on esimerkiksi aluekoodin 2 DVD-asema, se voi toistaa Suomesta ja muualta Euroopasta ostettuja DVD-elokuvia. DVD-aseman aluekoodi on usein mahdollista vaihtaa muutaman kerran, ennen kuin aluekoodi lukitaan viimeksi käytettyyn alueeseen. Käytä DVD-aseman aluekoodin muuttamiseen ohjelmaa nimeltä regionset.", " HUD (lyhenne englanninkielisistä sanoista Heads Up Display) on tekstipohjainen vaihtoehto perinteisille valikoille. Se esiteltiin ensimmäisen kerran Ubuntun 12.04 LTS -versiossa. Joidenkin sovellusten, kuten Gimpin ja Inkscapen, valikoissa on satoja toimintoja. Näissä ja vastaavanlaisissa sovelluksissa saatat muistaa toiminnon nimen, mutta et ehkä muista missä kohtaa valikoita kyseinen toiminto sijaitsee. Hakukentän käyttäminen saattaa olla nopeampaa kuin valikkorakenteiden läpikäynti. HUD saattaa myös olla valikkoja helppokäyttöisempi niille, joilla on vaikeuksia hiiren käyttämisen kanssa. Kokeile HUDia: Avaa HUD painamalla Alt. Aloita kirjoittaminen. Kun näet haluamasi toiminnon, käytä nuolinäppäimiä ylös ja alas valitaksesi sen ja paina sitten Enter. Vaihtoehtoisesti voit myös valita haluamasi toiminnon napsauttamalla sitä hiirellä. Jos muutat mielesi ja haluat poistua HUDista, paina Alt-näppäintä uudelleen tai Esc-näppäintä. Voit myös napsauttaa missä tahansa HUDin ulkopuolella sulkeaksesi sen. HUD tallentaa tehdyt haut ja käyttää niitä tulevaisuudessa hakutulosten osuvuuden parantamiseen.", " Käynnistin on Unity-työpöydän keskeisimpiä osia. Se näkyy näytön vasemmassa laidassa, kun kirjaudut työpöydälle. Käynnistimen avulla sovellusten, työtilojen, erillisten tallennusvälineiden ja roskakorin käyttö on nopeaa. Jos haluamasi sovelluksen kuvake näkyy käynnistimessä, napsauta sitä. Sovellus käynnistyy ja on välittömästi valmis käytettäväksi. Saat lisätietoja käynnistimestä alapuolelta löytyvistä ohjeaiheista.", " Documents is a GNOME application that lets you display,\n   organize, and print the documents on your computer or those created remotely\n   using Google Docs or SkyDrive.", " Väriavaruus on määritelty värien vaihteluväli. Tunnettuja väriavaruuksia ovat sRGB, AdobeRGB ja ProPhotoRGB. Ihmissilmä ei ole yksinkertainen RGB-tunnistin, mutta ihmissilmän havaitsemia värejä voi arvioida CIE 1931 -väridiagrammilla. Se näyttää ihmissilmän vastineen hevosenkengän muotoisena. Kyseisen väridiagrammin avulla on mahdollista huomata, että ihmissilmä havaitsee paljon enemmän vihreän sävyjä kuin sinisen tai punaisen sävyjä. Kolmivärisessä väriavaruudessa, kuten RGB:ssä, värit esitetään tietokoneella käyttäen kolmea arvoa, josta aiheutuu värien kolmikulmainen määritys. CIE 1931 -väridiagramminen kaltaisten mallien käyttö on ihmisen näköaistin yksinkertaistamista. Todelliset gamutit ilmaistaan kolmiulotteisina malleina kaksiulotteisten projektioiden sijaan. Kaksiulotteinen projektio kolmiulotteisesta mallista saattaa olla toisinaan harhaanjohtava, joten jos haluat nähdä kolmiulotteisen mallin, asenna gnome-color-manager ja suorita gcm-viewer. \n    First, looking at sRGB, which is the smallest space and can encode\n    the least number of colors.\n    It is an approximation of a 10 year old CRT display, and so most\n    modern monitors can display more colors than this.\n    sRGB is a least-common-denominator standard and is used\n    in a large number of applications (including the Internet).\n   AdobeRGB on yleisesti käytetty editointiavaruus. Se kykenee käsittelemään enemmän värejä kuin sRGB, eli valokuvissa olevia värejä voi vaihtaa melko huolettomasti ilman pelkoa, että kaikkein elävimmät värit leikkautuvat pois tai mustan sävyt sekoittuvat. ProPhoto on suurin saatavilla oleva väriavaruus, ja sitä käytetään usein asiakirjojen arkistointiin. Sillä voidaan koodata lähes koko ihmissilmän havaitsema värimaailma, ja myös joitain värejä joita silmä ei voi havaita. Jos ProPhoto on selvästi paras vaihtoehto, miksi sitä ei sitten käytetä kaikkialla? Vastaus kiteytyy termiin kvantisointi. Jos kanavaa kohden on käytettävissä vain kahdeksan bittiä (256 tasoa), suurempi vaihteluväli sisältää eri arvojen välillä suuremmat askeleet. Isommat askeleet tarkoittavat suurempia virheitä kuvauksessa kaapatun värin ja tallennetun värin välillä, ja joillain väreillä tämä on iso ongelma. Jotkin värit, kuten ihon sävyt, ovat hyvin tärkeitä. Näissä tavalliset kuvien katselijat huomaavat pienetkin virheet, ikään kuin valokuvassa olisi jotain vialla. 16-bittisten kuvien käyttö antaa käytettäväksi huomattavasti useampia askeleita ja paljon pienemmän kvantisointivirheen, mutta samalla kuvan koko kaksinkertaistuu. Suurin osa nykyisestä sisällöstä sisältää kahdeksan bittiä kuvapisteen väriä kohden. Värinhallinta on prosessi, jossa värit muutetaan yhdestä väriavaruudesta toiseen. Väriavaruus voi olla hyvin tunnettu määritelty väriavaruus, kuten sRGB, tai oman monitorisi tai tulostimesi muokattu väriavaruus.", " Virtuaalinen laite on värihallittu laite, joka ei ole kytkettynä tietokoneeseen. Esimerkkejä tällaisista ovat: Verkossa toimiva tulostustalo, jonne valokuvat lähetetään tulostettaviksi Digitaalikameran muistikortilla olevat valokuvat Luodaksesi virtuaaliprofiilin digitaalikameralle, vedä ja pudota kuvatiedostoja Järjestelmäasetukset ▸  ->  ▸ Värit -valintaikkunaan. Voit sitten määrittää profiileja sille kuten muillekin laitteille, tai jopa tehdä kalibroinnin.", " Valitettavasti monet valmistajan tarjoamat ICC-profiilit eivät sisällä koko näytön värinkorjaukseen vaadittavia tietoja. Kyseiset profiilit saattavat silti olla hyödyllisiä sovelluksille, jotka tekevät värikompensaatiota, mutta et näe kaikkien näytön värien muuttuvan. Näyttöprofiilin luomiseksi, joka sisältää sekä kalibrointi että karakterisointi tiedot, sinun tarvitsee käyttää erityisiä värien mittauslaitteita, kuten värimittaria tai spektrometriä.", " Säädä äänen voimakkuutta napsauttamalla valikkopalista löytyvää äänivalikkoa ja siirtämällä säädintä oikealle tai vasemmalle. Voit myös hiljentää äänet kokonaan painamalla Vaimenna ja palauttaa ne napsauttamalla Palauta äänet. Useissa näppäimistöissä on niin sanotut medianäppäimet, joiden avulla on mahdollista muuttaa äänenvoimakkuutta. Kyseiset näppäimet näyttävät yleensä kaiuttimilta, joiden läheisyydessä on \"ääniaaltoja\". Medianäppäimet sijaitsevat yleensä \"F-näppäinten\" (esim. F7) lähettyvillä. Kannettavissa paina Fn-näppäintä pohjassa käyttääksesi medianäppäimiä. Jos käytössä on kaiuttimet, voit toki muuttaa niiden äänenvoimakkuutta itse kaiuttimista tai vahvistimesta. Myös jotkin kuulokkeet sisältävät säätimen äänenvoimakkuudelle. Voit säätää ääntä toistavien tai nauhoittavien toiston (tai nauhoituksen) voimakkuutta sovelluskohtaisesti. Tämä on käytännöllistä esimerkiksi silloin kun kuuntelet musiikkia ja katsot Internetistä videota samaan aikaan. Halutessasi voit myös kytkeä vaikkapa selaimen äänet kokonaan pois, jolloin kuulet vain musiikkisoittimen äänen. Joillakin sovelluksilla on myös omat näppäimet äänenvoimakkuuden säätämiseen. Jos käyttämälläsi sovelluksella on ne, kannattaa käyttää niitä äänenvoimakkuuden säätämiseen. Jos taas ei, napsauta äänivalikkoa valikkopalkissa ja valitse sitten Ääniasetukset. Siirry Sovellukset-välilehdelle ja säädä haluamiesi sovellusten voimakkuutta sieltä. Vain sovellukset, jotka juuri sillä kyseisellä hetkellä toistavat tai nauhoittavat ääntä, esitetään. Jos ääntä soittava/nauhoittava sovellus ei löydy listasta, se ei välttämättä tue sen äänenvoimakkuuden säätämistä järjestelmän kautta. Tällöin et voi muuttaa sen äänenvoimakkuutta, ellei itse sovelluksesta löydy tukea tälle toiminnolle.", " Jos käytettävissä on enemmän kuin yksi tulostin, voit valita mitä tulostinta käytetään oletuksena. Useimmiten käytetty tulostin on parasta asettaa oletukseksi. Napsauta kuvaketta aivan valikkopalkin oikeassa reunassa ja valitse Järjestelmäasetukset. Avaa Tulostimet. Napsauta haluamaasi tulostinta käytettävissä olevien tulostimien listalta ja napsauta Aseta oletukseksi. When choosing from the list of available printers, you can\n  filter the printer search results by specifying a name or location of the\n  printer (for example, 1st floor or entrance). The search results filtering is available only in the dialog for addition of new printers. Kun tulostat sovelluksesta, käytetään järjestelmäsi oletustulostinta, ellet vaihda tulostinta tiettyä tulostyötä varten.", " Jos langattoman verkon salasana on kirjoitettu varmasti oikein, mutta yhteydenmuodostus ei siitä huolimatta onnistu, kokeile jotain seuraavista: Varmista, että kirjoittamasi salasana oli oikein Salasanoissa isoilla ja pienillä kirjaimilla on aina eri merkitys, joten tarkista aivan ensimmäisenä näiden merkkien oikeinkirjoitus. Yritä käyttää hex- tai ASCII-salausavainta Salasana on mahdollista esittää myös eri tavalla - niin sanottuna salausavaimena, eli numeroiden 0-9 ja merkkien a-f yhdistelmänä. Jokaisella salasanalla on oma salausavain. Jos tiedät sekä salasanan että salausavaimen, yritä syöttää salausavain salasanan sijaan.  Varmista, että valitset oikeanlaisen langattoman tietoturvan salasanaa kysyttäessä (valitse WEP 40/128-bit-avain (hexa tai ASCII), jos syötät WEP-salauksen 40-merkkistä salausavainta). Kytke langaton verkkoyhteys pois päältä ja sitten takaisin päälle Joskus langattomat verkkokortit jumiutuvat tai kohtaavat ongelman, josta ne eivät voi enää palautua. Kokeile kytkeä langaton verkkolaite tietokoneestasi ensin pois päältä ja sitten nollaamalla se (jos se ei ole mahdollista, käynnistä se). Lisätietoja saat ohjeesta Langattoman verkon ongelmanratkaisu. Tarkista, että käytät oikeanlaista verkon salaustekniikkaa Ubuntu kysyy verkon salasanan lisäksi verkon salaustyyppiä. Varmista, että valittu salaustyyppi on langattoman tukiaseman tukema. Tämän asetuksen pitäisi olla oletuksena oikea, mutta joskus se ei jostain syystä ole. Jos verkon salaustyyppi ei ole tiedossa, kannattaa kokeilla eri vaihtoehtoja ja testata niiden toimivuutta. Varmista, että langaton verkkokorttisi on kunnolla tuettu Joitain langattomia verkkokortteja ei tueta kovin hyvin. Ne näkyvät langattomien verkkojen listalla, mutta niillä verkkoyhteyden muodostaminen epäonnistuu yleensä ajureiden puutteiden vuoksi. Tarkista vaihtoehtoisten ajureiden saatavuus tai tee joitain teknisempiä tehtäviä, kuten eri laitteisto-ohjelmistojen asennusta. Saat lisätietoja ohjeaiheesta Langattoman verkon ongelmanratkaisu.", " Akun arvioitu kesto saattaa erota todellisesta kestoajasta, sillä akun kestoa voidaan vain arvioida. Yleensä arviot tarkentuvat ajan myötä. Akun keston arvioinnissa täytyy ottaa huomioon useita eri muuttujia. Yksi muuttujista on tietokoneen senhetkinen virrankulutus. Virrankulutus riippuu mm. käynnissä olevien ohjelmien määrästä, tietokoneeseen liitetyistä laitteista ja käynnissä olevien prosessien tehovaatimuksista (esimerkiksi DVD:n katsominen tai musiikin muuntaminen vaatii paljon tehoa). Hetkellinen virrankulutus muuttuu koko ajan, ja muutosten ennustaminen on hankalaa. Toinen muuttuja on akun purkautumistapa. Jotkut akut purkautuvat sitä nopeammin mitä tyhjemmiksi ne tulevat. Ilman tarkkaa tietoa akun purkautumisesta akun kestosta voidaan antaa vain suuntaa antavia arvioita. Kun akku purkautuu, virranhallinta saa selville akun purkautumisominaisuuksia ja oppii antamaan parempia arvioita akun kestosta. Arviot eivät kuitenkaan koskaan ole täydellisiä. Jos virranhallinta ehdottaa jotain täysin naurettavaa arvoa (kuten satoja päiviä), virranhallinta ei mitä luultavimmin saa tarpeeksi tietoa akun tilasta järkevän arvion tekemiseksi. Jos irrotat virtajohdon ja annat kannettavan tietokoneen toimia akun avulla hetken aikaa ennen virtajohdon kiinnittämistä ja akun latautumista, virranhallinta hankkii tarvittavia tietoja akun keston arvioimiseen.", " Tietokoneen langattoman verkkokortin avulla voi selata Internetiä, jakaa tiedostoja ja tehdä paljon muuta langattomasti, kunhan tietokone on langattoman verkon katealueella. Jos tietokoneessa on kytkinpainike langatonta yhteyttä varten, varmista että se on päällä. Napsauta verkkovalikkoa valikkopalkista ja etsi valikosta haluamasi verkko. Jos halutun verkon nimi ei ole listassa, verkkoja näytetään lisää napsauttamalla Lisää verkkoja. Jos haluttua verkkoa ei vieläkään löydy, voit olla sen kantomatkan ulottumattomissa tai verkko voi olla piilotettu. Kirjoita pyydettäessä verkon salasana (katso myös verkkojen salaukset) ja napsauta Yhdistä. Salasana mainitaan usein langattoman tukiaseman (reitittimen) kyljessä, laitteen käyttöohjeessa tai operaattorin toimittamassa oheismateriaalissa. Jos salasanaa ei löydy, sitä kannattaa kysyä verkon ylläpitäjältä, kuten operaattorilta. Verkkovalikon kuvake muuttuu, kun tietokone yrittää ottaa yhteyden verkkoon. Jos yhteydenmuodostus onnistuu, kuvake muuttuu pisteeksi, jonka päällä on aaltomaisia kaaria. Mitä useampi kaari, sitä vahvempi signaali on. Jos kaaria on vain muutama, signaali on heikko ja voi katkeilla. If the connection is not successful, you may be asked for your password again or it might just tell you that the connection has been disconnected. There are a number of things that could have caused this to happen. You could have entered the wrong password, the wireless signal could be too weak, or your computer's wireless card might have a problem, for example. See Langattoman verkon ongelmanratkaisu for more help. Vahvempi signaali ei suoraan tarkoita Internet-yhteyden nopeutumista. Langaton lähiverkko yhdistää tietokoneen Internet-yhteyden tarjoavaan laitteeseen (kuten reitittimeen tai modeemiin), jotka ovat jo itsessään kaksi täysin erilaista tapaa järjestää Internet-yhteys, ja joilla on erilaiset yhteysnopeudet.", " Kuten muutkin työpöydät, Unity käyttää ikkunoita käynnissä olevien sovellusten esittämiseen. Voit käynnistää uusia sovelluksia ja valita aktiivisen ikkunan Unity-valikon sekä käynnistimen kautta. Tämän lisäksi sovelluksia voi ryhmitellä myös työtilojen avulla. Tutustu ominaisuuksiin tarkemmin lukemalla alapuolelta löytyviä ikkuna- ja työtila-ohjeaiheita.", " Langattomat ja optiset hiiret, kuten myös jotkin kosketuslevyt kannettavissa tietokoneissa, saattavat vaatia pienen \"heräämisviiveen\", ennen kuin ne alkavat toimia. Ne menevät automaattisesti virransäästötilaan, kun niitä ei ole käytetty hetkeen. Herätä hiiri tai kosketuslevy napsauttamalla hiiren painiketta tai liikuttamalla hiirtä. Laptop touchpads sometimes react with delay after you stop typing before they start working. This is to prevent you from accidentally touching the touchpad with your palm while typing.", " Verkkotilin lisääminen helpottaa Ubuntun sovellusten käyttöönottoa, sillä esimerkiksi sähköposti- ja pikakeskustelusovellusten asetukset voidaan tehdä automaattisesti. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Verkkotilit. Valitse Tilin tyyppi ikkunan oikeanpuolimmaisesta paneelista. Useampien tilien luominen onnistuu toistamalla samat toimenpiteet myöhemmin. Suppea web-käyttöliittymä avautuu, johon annetaan tilin tunnistetiedot. Esimerkiksi Google-tiliä luodessa kenttiin tulee kirjoittaa Google-käyttäjänimi ja -salasana. Kun oikeat tunnistetiedot on syötetty, tulee hyväksyä käyttöehdot Hyväksy-painikkeella. Tämän jälkeen Ubuntu pyytää lupaa käyttää tiliäsi. Napsauta Salli käyttö ja anna salasana, kun sitä kysytään. Voit nyt valita sovellukset, jotka saavat oikeuden käyttää verkkotiliäsi. Jos esimerkiksi tiliä käytetään keskustelutilinä eikä sen kalenteriominaisuutta haluta hyödyntää, kalenteri voidaan poistaa käytöstä. Kun tili on luotu, jokainen valittu ohjelma käyttää automaattisesti antamiasi tunnistetietoja kirjautuessaan eri verkkopalveluihin. Turvallisuussyistä johtuen Ubuntu ei säilytä salasanaasi tietokoneellasi. Koneellasi säilytetään ainoastaan verkkopalvelun antamaa tunnistautumiskoodia. Jos haluat peruuttaa tietokoneesi ja verkkopalvelun välisen yhteyden kokonaan, poista tili.", " Värinhallinta on prosessi, jossa kaapataan kuva syötelaitteella, näytetään se näytöllä ja tulostetaan se niin,  että koko ajan hallussa pidetään täsmälliset oikeat värit sekä jokaisen eri median hallitsema väriavaruus. Tarve värienhallinnalle voidaan havainnollistaa valokuvalla linnusta kylmänä talvipäivänä. Tavallisesti ilmi käy ylikorostunut sininen kanava, mikä tekee kuvasta kylmän näköisen. Huomaa, kuinka valkoinen ei ole \"paperinvalkoinen\" ja silmän musta onkin nyt mutaisen ruskea. Perusongelma on, että jokainen laite kykenee hallitsemaan erilaisen joukon värejä. Tästä johtuen vaikka onkin mahdollista ottaa valokuva sähkönsinisestä väristä, useimmat tulostimet eivät pysty sitä toistamaan. Useimmat kuvalaitteet kaappaavat kuvan RGB-muodossa (punainen, vihreä, sininen) ja joutuvat muuntamaan sen CMYK-muotoon (syaani, magenta, keltainen, musta) tulostusta varten. Lisäksi ongelmana on, että valkoista mustetta ei ole, joten valkoinen voi olla korkeintaan yhtä valkoinen kuin paperi jolle tulostetaan. Toinen ongelma on yksiköt. Määrittämättä värien mittausaluetta ei tiedetä, onko \"100-prosenttinen punainen\" lähellä infrapunaa vai tulostimen tumminta punasävyä. Yhden näytön 50-prosenttinen punainen on toisen näytön 62-prosenttinen punainen. Tätä voisi verrata siihen, että ravintosuosituksessa neuvotaan juomaan kaksi annosta maitoa, ilman että sanotaan onko annos maitolasi vai maitolitra. Väreissä yksikkönä käytetään gamutia. Gamut on periaatteessa värisävyjen joukko, jonka laite pystyy toistamaan. Digitaalinen järjestelmäkamera saattaa omata erittäin suuren gamutin, eli se voi olla kykeneväinen tallentamaan kaikki auringonlaskun värit. Sen sijaan videotykillä voi olla todella pieni gamut, jolloin värit eivät erotu kunnolla, vaan sekoittuvat toisiinsa. Toisinaan on mahdollista korjata laitteen ulostuloa muuttamalla sille lähetettävää tietoa. Kun tämä ei ole mahdollista (sähkönsinisen tulostus on mahdotonta), käyttäjälle on näytettävä millainen lopputulos tulee olemaan. Valokuvissa on järkevää käyttää värilaitteen tonaalista kirjoa, jotta värimuutokset ovat sulavia. Muun grafiikan kohdalla voi olla tarpeen, että värit ovat aivan tarkkoja. Esimerkkinä Red Hat -logon tulostus kahvimukiin, jolloin punaisen tulee ehdottomasti vastata Red Hatin logon punaista.", " Jokaisen näytön oletusväriprofiili luodaan automaattisesti näytön muistiyksikössä olevaan EDID-tietoon pohjautuen. EDID tarjoaa vain vedoksen niistä väreistä, jotka näyttö pystyi toistamaan valmistusvaiheessa, eikä EDID sisällä juurikaan muuta tietoa värikorjausta varten. Näytön valmistajan tarjoamaa tai itse tehtyä profiilia käyttämällä voi päätyä tarkempaan värimaailmaan.", " Ubuntu tarjoaa mahdollisuuden muuttaa päivämäärien, kellonaikojen, lukujen, valuutan ja mittojen esitysmuotoa paikallisia esitysmuotoja vastaaviksi. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Kieliasetukset ja valitse Alueelliset muotoilut -välilehti. Valitse alue, jonka esitysmuodot sopivat sinulle parhaiten. Oletuksena luettelosta löytyvät ne alueet, jotka käyttävät Kieli-välilehdellä valittuja kieliä. Muutokset astuvat voimaan kirjautuessasi sisään uudelleen. Kirjaudu ulos napsauttamalla kuvaketta oikeassa yläkulmassa ja valitse Kirjaudu ulos. Kun alue on valittu, ikkuna näyttää esimerkin valitun alueen muotoiluista. Valittu alue määrittää myös viikon ensimmäisen päivän kalentereissa, vaikka sitä ei esimerkeissä esitelläkään. Alueellisten muotoiluasetusten muuttaminen vaikuttaa vain sinun käyttäjätiliisi. Voit myös vaihtaa järjestelmän käyttämiä muotoiluja, joita käytetään muun muassa kirjautumisruudussa. Vaihda muotoiluja edellä olevien ohjeiden mukaan. Napsauta Toteuta järjestelmänlaajuisesti. Tarvitset ylläpitäjän oikeudet. Anna salasanasi tai pyydetyn ylläpitotilin salasana.", " Gedit-tekstimuokkain ja muutkin sovellukset tekevät automaattisesti varmuuskopioita muokatuista tiedostoista. Nämä muokatut tiedostot tunnistaa tiedoston nimen perässä olevasta \"~\" merkistä. (esimerkiksi esimerkki.txt~). Yleensä näiden varmuuskopiotiedostojen poistaminen on turvallista, mutta toisaalta niiden olemassa olosta ei ole haittaa. These files are hidden by default. If you are seeing them, that is because\n you either selected Show Hidden Files (in the\n  menu of the\n Files toolbar) or pressed\n Ctrl+H. You can hide them again by\n repeating either of these steps. Näitä tiedostoja kohdellaan samalla tavalla kuin muitakin piilotiedostoja. Lue Tiedoston piilottaminen saadaksesi lisätietoa piilotiedostoista.", " Voit muuttaa näytön tarkkuutta (näytöllä näkyvien esineiden kokoa) näytön resoluutio säätimellä. Voit säätää mikä sivu näytöstä on yläreuna (esimerkiksi kierrettävät näytöt) muuttamalla kierto asetuksia. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Näytöt. Jos käytössäsi on useita näyttöjä eikä niitä ole peilattu, voit määrittää eri asetukset jokaiseen näyttöön. Valitse näyttö esikatselualueelta. Valitse haluamasi tarkkuus ja kierto. Napsauta Toteuta. Asetuksiin tehdyt muutokset kumotaan automaattisesti ellet vahvista niitä 30 sekunnin kuluessa painamalla Säilytä nämä asetukset. Tämä ominaisuus on luotu sitä varten, että jos uudet asetukset eivät syystä tai toisesta toimi, automaattinen kumoaminen pelastaa tilanteen vähällä vaivalla. Useimmissa tapauksissa käyttöjärjestelmä havaitsee tietokoneeseen kiinnitetyn näyttölaitteen, kuten projektorin, automaattisesti. Ellei näin tapahdu, paina Tunnista näytöt painiketta. Liitetyn näyttölaitteen asetusten muokkaaminen onnistuu normaalin näytön tapaan Järjestelmäasetusten Näytöt-osiosta. Näytön tarkkuus on näytöllä näytettävien pikselien (pisteiden) määrä pysty- ja vaakasuunnassa. Jokaisella tarkkuudella on kuvasuhde, joka määrittää näytön leveyden suhteen korkeuteen. Laajakuvanäytöissä kuvasuhde on 16:9 kun taas perinteisissä näytöissä 4:3. Jos valitset tarkkuuden, jonka kuvasuhde ei ole sama kuin näyttösi kuvasuhde, lisätään näytön reunoille mustia palkkeja vääristymien estämiseksi. Voit muuttaa oletustarkkuutta valitsemalla jonkin toisen tarkkuuden pudotusvalikosta. Jos valitset näytöllesi sopimattoman tarkkuuden, se voi näyttää sumealta tai epätarkalta. Joissain kannettavissa tietokoneissa on mahdollista kiertää näyttö moniin eri suuntiin, jolloin näytön kierron muuttaminen on hyödyllistä. Voit valita haluamasi kiertoasetuksen Kierto-pudotusvalikosta.", " Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Verkkotilit. Valitse poistettava tili ikkunan vasemmasta reunasta. Paina Poista tili ikkunan oikeasta alakulmasta. Tilin poistaminen Verkkotileistä ei vaikuta tiliisi verkkopalvelussa millään tavalla. Napsauta Poista. Tilin poistamisen sijasta voit myös rajoittaa palvelun käyttöä.", " Tuki verkkopalvelulle vaatii, että joku kehittää ja ylläpitää sitä. Tällä hetkellä seuraavia verkkopalveluja tuetaan: Facebook Flickr Google Twitter AIM Windows Live Salut Jabber Yahoo Jos tuen lisääminen muihin palveluihin kiinnostaa, ota yhteyttä kehittäjiin vianhallintajärjestelmän kautta.", " Kun kannettavan tietokoneen kansi suljetaan, kannettava siirtyy lepotilaan virran säästämiseksi. Tietokonetta ei siis sammuteta vaan se laitetaan nukkumaan. Voit jatkaa työskentelyä avaamalla kannettavan kannen. Jos tämä ei palauta konetta lepotilasta, napsauta hiirtä tai paina jotakin näppäintä. Ellei tämäkään toimi, paina virtanappia. Valmiustila ei toimi kaikissa tietokoneissa. Tämä johtuu yleensä siitä, että käyttöjärjestelmä ei tue laitteistoa täysin (esimerkiksi Linux-ajurit ovat keskeneräiset). Tässä tapauksessa valmiustilasta palaaminen kannen sulkemisen jälkeen saattaa epäonnistua. Voit yrittää korjata valmiustilan ongelmat tai estää tietokonetta siirtymästä valmiustilaan, kun kansi on suljettu. Jos et halua tietokoneen siirtyvän valmiustilaan kannen sulkemisen yhteydessä, voit muuttaa tätä asetusta: Ole varovainen, jos muutat tätä asetusta. Jotkut kannettavat voivat ylikuumentua, jos ne jätetään päälle kannen ollessa kiinni. Tämä on todennäköistä eritoten silloin, kun ne ovat suljetussa tilassa kuten laukussa. Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Valitse Laitteisto-osiosta Virransäästö. Valitse Kun kansi suljetaan -tekstin vieressä olevasta pudotusvalikosta arvoksi Älä tee mitään.", " Voit vaihtaa työpöydän taustakuvaa, asettaa taustalle liukuvärin tai pelkästään yhden värin. Napsauta hiiren oikealla työpöytää ja valitse Muuta työpöydän taustaa. Valitse kuva tai väri. Asetukset otetaan käyttöön välittömästi. Oikealla olevassa pudotusvalikossa on kolme vaihtoehtoa. Valitse Taustakuvat käyttääksesi Ubuntun mukana tulleita tasokkaita taustakuvia. Ubuntun oletustaustakuvaa lukuun ottamatta kaikki tässä kohdassa valittavissa olevat taustakuvat on yhteisön tekemiä, kilpailun kautta valittuja taustakuvia. Jotkin taustakuvat ovat osittain läpinäkyviä ja mahdollistavat taustavärin näkymisen taustalla. Näiden taustakuvien kohdalla on mahdollista valita taustaväri ikkunan oikean alareunan läheltä. Valitse Kuvat-kansio käyttääksesi kotikansion alla olevassa Kuvat-kansiossa olevia kuvia taustakuvana. Useimmat valokuvien hallintaan tarkoitetut sovellukset tallentavat kuvat tähän kansioon. Voit valita myös Värit ja liukuvärit käyttääksesi yhtä väriä tai väriliukua. Värivalintapainikkeet sijaitsevat ikkunan oikeassa alareunassa. Voit halutessasi selata mitä tahansa koneellasi olevaa kuvaa napsauttamalla +. Jos lisäät kuvan tätä kautta, se näkyy kohdassa Kuvat-kansio. Jos haluat, voit poistaa kuvan luettelosta napsauttamalla -. Poistaminen ei poista alkuperäistä tiedostoa.", " Akun varaustason laskiessa liian alas tietokone siirtyy automaattisesti lepotilaan (ohjelmat ja tiedostot tallennetaan ja sitten sammutetaan). Tämän toiminnon tarkoituksena on suojata akkua täydelliseltä tyhjentymiseltä, joka voi johtaa akun käyttöiän vähenemiseen. Jos tietokoneen akku ehtii tyhjentyä kokonaan, ohjelmien tilaa ei ehditä tallentaa. You can change what happens when the battery level gets too low. First, click the \nbattery menu in the menu bar and select Power Settings. At the 'When\npower is critically low' setting, you can choose for the computer to\nsuspend, hibernate, or shut down. If you choose shut down, your applications and\ndocuments will not be saved when the computer turns off. Joillakin tietokoneilla on ongelmia lepotilasta palautumisessa. Tämän takia ennen lepotilaa käytetyt sovellukset eivät välttämättä ole enää käytettävissä, kun tietokone otetaan uudelleen käyttöön. Joitakin tietoja saattaa siis kadota, ellet tallenna tietojasi itse ennen lepo- tai valmiustilaan asettamista. Lepotilan ongelmia voi myös yrittää korjata.", " Tässä ohjeessa on selitykset kaikille verkkoasetusten kohdille. Verkkoyhteyksien asetuksia voi muokata napsauttamalla verkkovalikkoa valikkopalkista ja valitsemalla sitten Muokkaa yhteyksiä. Useimmat verkot toimivat moitteetta oletusasetuksilla, joten asetuksia ei tarvitse välttämättä muuttaa lainkaan. Monet näistä valinnoista mahdollistavat kuitenkin verkkoyhteyden tarkempien määritysten asettamisen. Valitse tämä asetus, jos haluat tietokoneen yrittävän muodostaa yhteyden aina kyseisen verkon ollessa saatavilla. Jos saatavilla on useita eri verkkoja, joihin tietokone on asetettu yhdistymään, tietokone yhdistää Verkko-ikkunan Langaton-välilehdellä ensimmäisenä olevaan verkkoon. Tietokone ei katkaise yhteyttä verkkoon, jos saataville ilmaantuu muita verkkoja. Valitse tämä asetus, jos haluat kaikilla tietokoneen käyttäjillä olevan mahdollisuus käyttää tätä yhteyttä. Jos kyseinen verkko on suojattu WEP-/WPA-salasanalla ja tämä asetus on valittu, verkon salasana on annettava vain kerran. Muiden käyttäjien ei siis tarvitse tietää verkon salasanaa, jotta he voivat käyttää verkkoyhteyttä. Jos tämä asetus on valittu, sinulla tulee olla ylläpitäjän oikeudet yhteyden asetuksien muuttamiseksi. SSID tarkoittaa langattoman verkon nimeä. Lyhenne tulee englanninkielisistä sanoista Service Set Identifier. Älä muuta tätä asetusta, ellet ole vaihtanut langattoman verkon nimeä esimerkiksi reitittimestä. Use this to specify whether you are connecting to an Infrastructure network (one where computers wirelessly connect to a central base station or router) or an Ad-hoc network (where there is no base station, and the computers in the network connect to one another). Most networks are infrastructure ones; you may wish to set-up your own ad-hoc network though. Jos Ad-hoc valitaan, tulee näkyville kaksi muuta valintaa, jotka ovat Taajuusalue ja Kanava. Nämä määrittävät, mitä langatonta taajuusaluetta ad-hoc-verkko käyttää. Jotkin tietokoneet voivat toimia vain tietyillä taajuusalueilla (esimerkiksi vain A tai vain B/G), joten on hyödyllistä valita taajuusalue jota kaikki ad-hoc-verkon tietokoneet voivat käyttää. Ruuhkaisissa paikoissa saattaa olla käytössä useita saman kanavan jakavia langattomia verkkoja, mikä saattaa hidastaa yhteyksiä. Tällöin voidaan vaihtaa myös käytettävää kanavaa. BSSID on lyhenne englanninkielisistä sanoista Basic Service Set Identifier. Siinä missä SSID (selvitetty ylempänä) on verkon ihmiselle näkyvä nimi, BSSID on tietokoneelle näkyvä verkon nimi. Jos langaton verkko on piilotettu, sillä ei ole SSID:tä, mutta sillä on silti BSSID. MAC-osoite on verkkolaitteen (esim. langaton verkkosovitin, Ethernet-verkkokortti tai reititin) yksilöivä koodisarja. Jokainen verkkoon kytkettävä laite omaa valmistustehtaalla annetun yksilöivän MAC-osoitteen. Tätä valintaa voi käyttää verkkokortin MAC-osoitteen vaihtamiseksi. Verkkosovittimesi voi esittää omaavansa jonkin toisen MAC-osoitteen, kuin mitä sillä todellisuudessa on. Tämä on hyödyllinen ominaisuus, jos jokin verkko tai palvelu suostuu toimimaan vain tietyn MAC-osoitteen kanssa. Aseta Kopioitu MAC-osoite -kenttään haluttu MAC-osoite, niin muut palvelut, verkot ja laitteet uskovat koneesi verkkosovittimella olevan kyseinen MAC-osoite. Tämä asetus muuttaa pakettien enimmäiskokoa (MTU, lyhenne englanninkielisistä sanoista Maximum Transmission Unit). Paketin enimmäiskoolla tarkoitetaan verkon yli lähetettävän paketin suurinta mahdollista kokoa. Kun verkossa lähetetään tietoa, tieto pilkotaan pieniksi paloiksi (eli paketeiksi). Pakettien enimmäiskoko riippuu käyttämästäsi verkosta ja yhteyden nopeudesta. Tätä asetusta ei tule muuttaa, ellei tiedä mitä on tekemässä. Tämä asetus määrittää, minkälaista salausta langaton verkko käyttää. Langattoman verkon salauksen on tarkoitus estää muita käyttämästä verkkoasi sekä näkemästä, mitä tietoa verkkoyhteytesi välittää. Salaustapojen vahvuudessa on suuria eroja, mutta kaikki uudemmat ja tehokkaammat salaustavat eivät välttämättä ole tuettuja vanhoilla verkkolaitteilla. Salatun yhteyden käyttö vaatii normaalisti salasanan, kehittyneemmät salaustekniikat käyttäjätunnuksen ja varmenteen. Lue ohje Mitä WEP ja WPA tarkoittavat? saadaksesi lisätietoja erilaisista salaustavoista. Määritä tällä välilehdellä verkkoyhteyteen liittyvät tiedot, kuten tietokoneen IP-osoitteen ja käytettävän DNS-nimipalvelimen. Katso Menetelmä-pudotusvalikosta erilaisia tapoja verkkoasetusten määrittämiseen. Seuraavat menetelmät ovat käytettävissä: Nouda automaattisesti DHCP-palvelimelta kaikki vaadittavat asetukset, kuten IP-osoite ja DNS-nimipalvelin. DHCP-palvelin on tietokone (tai mitä luultavimmin laite, kuten reititin), joka on yhteydessä verkkoon. Se päättää, mitä asetuksia samaan verkkoon yhdistävät tietokoneet saavat. Kun yhdistät ensimmäisen kerran DHCP-palvelimella varustettuun verkkoon, tietokoneellesi määritetään automaattisesti tarvittavat asetukset. Useimmat verkot käyttävät DHCP-palvelimia. Jos valitset tämän asetuksen, tietokoneesi noutaa IP-osoitteen DHCP-palvelimelta, mutta kaikki muut verkkoyhteyden tiedot (kuten käytettävä DNS-nimipalvelin) tulee määrittää itse. Valitse tämä asetus, jos haluat määrittää verkkoyhteyden kaikki asetukset itse, mukaan lukien tietokoneen käyttämän IP-osoitteen. Vain linkkiyhteys on tapa yhdistää tietokoneita toisiinsa ilman tarvetta DHCP-palvelimelle tai itse määritellyille verkkoasetuksille. Jos yhdistät Vain linkkiyhteys -verkkoon, kyseisessä verkossa olevat tietokoneet päättävät itse tarvittavat verkkoasetukset. Tämä on hyödyllistä silloin, kun tietokoneita halutaan verkottaa toisiinsa väliaikaisesti ilman vaikeiden asetusten tekoa. Tämä asetus poistaa verkkoyhteyden käytöstä ja estää siihen yhdistämisen. Otathan huomioon, että IPv4- ja IPv6-yhteyksiä käsitellään erillisinä yhteyksinä, vaikka ne muodostettaisiin samalla verkkolaitteella. Jos käytössäsi on IPv4, saatat haluta poistaa IPv6:n käytöstä. Sama pätee myös toisinpäin. Tämä on vastaavanlainen kuin IPv4-välilehti sillä erotuksella, että kyseessä on uudempi IPv6-standardi. Todella nykyaikaiset verkot käyttävät IPv6-teknologiaa, IPv4 on vielä nykypäivänä huomattavasti yleisempi.", " Kun tietokone toimii akun varassa, näyttö himmennetään koneen ollessa käyttämättä virran säästämiseksi. Kun alat taas käyttää tietokonetta, himmennys poistuu. Voit estää näyttöä himmentymästä: Napsauta valikkopalkin oikeanpuoleisinta kuvaketta ja valitse Järjestelmäasetukset. Avaa Kirkkaus ja lukitus ja poista valinta kohdasta Himmennä näyttöä virran säästämiseksi.", " VPN-yhteydellä (lyhenne englanninkielisistä sanoista Virtual Private Network) voidaan muodostaa yhteys lähiverkkoon Internetin kautta. Kuvataan VPN:ää tosielämän esimerkillä. Olet työmatkalla, ja haluat ottaa yhteyden työpaikkasi lähiverkkoon. Hotellissasi on Internet-yhteys, jonka kautta muodostat VPN-yhteyden työpaikallesi. Näin työpaikan lähiverkon käyttö onnistuu vaivattomasti. VPN-yhteyksien liikenne on pääsääntöisesti salattu, eli lähiverkon käyttö VPN-yhteydellä on turvallista. There are a number of different types of VPN. You may have to install some extra software depending on what type of VPN\nyou're connecting to. Find out the connection details from whoever is in charge of the VPN and see which VPN client\nyou need to use. Then, open Ubuntu Software and search for the network-manager package which works\nwith your VPN (if there is one) and install it. Jos VPN-yhteystyypillesi ei ole tarjolla soveltuvaa NetworkManager-pakettia, joudut mitä luultavimmin lataamaan ja asentamaan VPN-ohjelmiston sitä tarjoavalta yritykseltä. Seuraa kyseisen yrityksen tarjoamia asennusohjeita. Kun yllä mainitut toimenpiteet on tehty, VPN-yhteyden määritys on mahdollista seuraavasti: Avaa verkkovalikko valikkopalkista ja valitse VPN-yhteydet-alivalikosta Määrittele VPN-yhteys. Napsauta Lisää ja valitse haluamasi VPN-yhteyden tyyppi. Napsauta Luo ja seuraa ohjeita, eli anna tiedot kuten käyttäjätunnus ja salasana. Kun olet määrittänyt VPN-yhteyden, avaa verkkovalikko valikkopalkista ja napsauta juuri luomaasi yhteyden nimeä VPN-yhteydet-alivalikosta. Tietokone yrittää nyt muodostaa VPN-yhteyden, ja sen merkkinä verkkovalikon kuvake muuttuu. VPN-yhteys muodostui toivon mukaan onnistuneesti. Jos VPN-yhteys ei toimi, tarkista antamasi VPN-asetukset. Avaa verkkovalikko, valitse Muokkaa yhteyksiä ja siirry VPN-välilehdelle. Jos haluat katkaista VPN-yhteyden, avaa verkkovalikko ja valitse Katkaise VPN-yhteys VPN-alivalikosta.", " Useissa tietokoneissa on muistikortinlukija, joka tukee muun muassa SD- (Secure Digital), MMC- (MultiMediaCard), SmartMedia-, Memory Stick - ja CompactFlash-muistikortteja. Tietokoneesi pitäisi havaita ja liittää nämä automaattisesti. Tässä muutama ongelmanratkaisuehdotus, jos muistikortteja ei liitetä automaattisesti: Varmista, että kortti on asetettu lukijaan kunnolla. Moni kortti näyttää siltä, että se olisi väärin päin vaikka se olisi asetettu oikein. Varmista myös, että kortti on tukevasti kiinni lukijassa; erityisesti CompactFlashin, ja joidenkin muiden korttien asettaminen vaatii vain vähän voimaa. (Ole varovainen ettet työnnä korttia liian lujaa! Jos kortti ei tahdo mennä sisään, älä yritä tunkea korttia syvemmälle.)  Open Files by using the Dash. Does the inserted\n card appear in the Devices list in the left sidebar? Sometimes the card appears in this list but is not mounted; click it once to mount. (If the sidebar is not visible, press F9 or click\n View ▸  Sidebar ▸  Show Sidebar.)\n Jos korttisi ei näy sivupalkissa, mene Siirry ▸ Tietokone. Jos kortinlukijan asetukset ovat kunnossa, sen tulisi näkyä asemana silloin, kun korttia ei ole asetettu ja kun kortti on paikallaan, sen tulisi näkyä korttina (kuva alla). Jos näet kortinlukijan muttet korttia, ongelma voi olla kortti itse. Yritä toista korttia tai testaa korttia toisella kortinlukijalla mahdollisuuksien mukaan. Jos Tietokone-kansiossa ei ole kortinlukijoita, on mahdollista, että kortinlukijasi ei toimi Linuxissa ajuriongelmien vuoksi. Tämä on mahdollista varsinkin jos kortinlukija on sisäinen (tietokoneen sisällä, ei ulkopuolella). Paras ratkaisu on yhdistää laite (kamera, matkapuhelin, jne.) suoraan tietokoneen USB-porttiin. USB-porttiin kytkettäviä ulkoisia kortinlukijoita on myös saatavilla, ja ne ovat huomattavasti paremmin tuettu Linuxissa.", " Väriprofiilin vaikutuksia on joskus vaikea huomata, sillä erot voivat olla hyvin pieniä. Tarjoamme usean eri profiilin testausta varten. Niiden avulla on helppo havaita profiilien vaikutus: Sinertävä testi: Muuttaa näytön siniseksi ja testaa lähetetäänkö näytölle kalibrointikäyrät ADOBEGAMMA-testi: Muuttaa näytön vaaleanpunaiseksi ja testaa näyttöprofiilin eri ominaisuuksia \nFakeBRG: This will not change the screen, but will swap\n        around the RGB channels to become BGR.\n        This will make all the colors gradients look mostly correct, and\n        there won't be much difference on the whole screen, but images\n        will look very different in applications that support color\n        management.\n       Lisää jokin testiprofiili näyttöösi väriasetuksissa Järjestelmäasetukset ▸ Väri. Näitä profiileja käyttämällä huomaat selvästi, kun sovellus tukee värinhallintaa.", " Ennen kuin voit käyttää Bluetooth-laitetta kuten hiirtä tai kuulokemikrofonia, laitteet tulee yhdistää tietokoneeseen. Tätä kutsutaan myös Bluetooth-laitteiden parittamiseksi. Ennen aloittamista, varmista että Bluetooth on kytketty päälle. Katso Bluetoothin kytkeminen päälle tai pois. Valitse Bluetooth-kuvake valikkopalkista ja napsauta Asenna uusi laite... Aseta Bluetooth-laitteesi löydettäväksi (myös termiä \"näkyvä\" käytetään) ja varmista, että kyseinen laite on alle 10 metrin etäisyydellä tietokoneesta. Napsauta sitten Jatka. Tietokone alkaa etsiä muita Bluetooth-laitteita. Jos laitteita on liikaa, käytä Laitetyyppi -pudotusvalikkoa näyttämään vain yhdentyyppisiä laitteita listassa. Valitse PIN-valinnat... asettaaksesi, miten PIN siirretään toiseen laitteeseen. Automaatiinen PIN-aestus käyttää kuusinumeroista koodia. Laite, jolla ei ole näppäimiä tai näyttöä (kuten hiiri tai langattomat kuulokkeet), voivat tarvita tietyn PIN:in, kuten 0000 tai PIN:iä ollenkaan. Tarkista oikeat asetukset laitteesi ohjekirjasta. Valitse laitteellesi sopiva PIN-valinta ja napsauta Sulje. Valitse Eteenpäin jatkaaksesi. Jos et valinnut esiasettua PIN:iä, PIN näytetään näytöllä. Tarvittaessa voit vahvistaa toisen laitteesi PIN-koodin. Laitteen tulisi näyttää sinulle PIN-koodi, jonka näet tietokoneesi ruudulla, tai voi pyytää sinua kirjoittamaan PIN-koodin. Vahvista PIN laitteella ja napsauta Täsmää. Kirjoita PIN-koodi toiselle laitteelle, jos se vaatii sitä. Sinun täytyy suorittaa kirjautuminen noin 20 sekunnissa useimmilla laitteilla tai yhteyttä ei luoda. Jos se tapahtuu, palaa laitelistaan ja aloita alusta. Kun yhteys muodostuu onnistuneesti, näytölle ilmaantuu viesti. Napsauta Sulje. Voit poistaa Bluetooth-yhteyden myöhemmin niin halutessasi. Hallitse pääsyä jakamiisi tiedostoihin Bluetooth-jakamisen asetuksilla. Lisätietoja ohjeessa Hallitse jakamista Bluetoothin kautta.", " Ääniongelmat voivat johtua monista eri syistä. Mikä seuraavista kuvaa parhaiten ongelmaasi?", " Unity-valikko mahdollistaa sovellusten, tiedostojen, musiikin, ja videoiden etsimisen. Lisäksi se näyttää viimeksi käyttämäsi kohteet. Hyödyt tästä ominaisuudesta, jos esimerkiksi teit taulukon tai muokkasit kuvaa, mutta et muista sen sijaintia. Avaa Unity-valikko napsauttamalla käynnistimen ylintä kuvaketta. Siinä on Ubuntun logo. Pikanäppäintä Super painamalla näet valikon heti. Sulje Unity-valikko napsauttamalla ylintä kuvaketta uudelleen, tai painamalla Super tai Esc. Unity-valikon avaamalla näet ensin päänäkymän. Mitään napsauttamatta tai kirjoittamatta Unity-valikko näyttää viimeksi käytetyt sovellukset ja tiedostot. Jokaiselle tulosryhmälle on varattu yksi rivi tilaa. Jos tuloksia on enemmän, napsauta Näytä lisää tuloksia nähdäksesi ne. Etsi kirjoittamalla, jolloin hakutulokset asennetuista näkymistä ilmestyvät automaattisesti. Napsauta tulosta avataksesi sen, tai paina Enter avataksesi luettelossa ensimmäisenä olevan kohteen. Näkymien avulla voit kohdistaa Unity-valikon tiettyihin hakutuloksiin ja estää muiden näkymien hakutulosten esittämisen. Käytettävissä olevat näkymät esitetään Unity-valikon alaosassa, tummana alueena niin sanotussa näkymäpalkissa. Vaihda eri näkymien välillä napsauttamalla haluamasi näkymän kuvaketta tai painamalla Ctrl+Tab. Suodattimet mahdollistavat hakutulosten tarkemman rajaamisen. Napsauta Rajaa hakutuloksia rajataksesi hakuehtoja. Joidenkin suodattimien asettaminen saattaa vaatia erillisen otsakkeen, kuten Lähteet-otsakkeen, painamista. Napsauttamalla hakutulosta hiiren oikealla painikkeella esikatselu avautuu antaen lisää tietoa hakutuloksesta. Sulje esikatselu napsauttamalla tyhjää tilaa tai painamalla Esc.", " Tietokoneen kanssa on mahdollista käyttää erillisiä kaiuttimia tai kuulokkeita. Kaiuttimet yhdistetään yleensä niin sanotulla 3,5 millimetrin stereoliitännällä (virallisesti TRS-liitin, lyhenne sanoista tip, ring, sleeve, eli kärki, keskirengas ja vaippa) tai USB-liittimellä. Jos kaiuttimissa tai kuulokkeissa on TRS-liitin, kytke se sille tarkoitettuun liitäntään. Useimmissa tietokoneissa on kaksi liitäntää: yksi mikrofonille ja yksi kaiuttimille. Etsi liitännän vierestä kuulokkeiden kuvaa. TRS-liitäntään liitetyt kaiuttimet tai kuulokkeet ovat yleensä oletuksena käytössä. Jos ääni ei kuitenkaan toistu automaattisesti, katso alta ohjeet oletuslaitteen valitsemiseksi. Joissain tietokoneissa on tuki monikanavaäänelle. Tällöin yleensä käytetään useita TRS-liitäntöjä, jotka on merkitty eri väreillä. Jos olet epävarma mikä liitin kuuluu mihinkin liitäntään, voit kokeilla äänen ulostuloa ääniasetuksista. Napsauta äänivalikkoa valikkopalkissa ja valitse Ääniasetukset. Valitse kaiuttimet laiteluettelosta ja napsauta sitten Kokeile ääntä. Kun ikkuna avautuu, napsauta kaiuttimien kuvakkeita yksitellen. Nyt ääni toistetaan napsautettua kuvaketta vastaavasta kaiuttimesta. USB-kaiuttimet tai -kuulokkeet tai analogiset kuulokkeet USB-äänikortiin yhdistettynä kytketään mihin tahansa USB-porttiin. Tietokone tunnistaa USB-kaiuttimet erillisinä äänilaitteina, ja niiden valinta oletusäänentoistolaitteeksi saattaa olla tarpeen. Avaa äänivalikko valikkopalkista ja napsauta Ääniasetukset. Valitse laite Ulostulo-välilehden laitelistalta. Jos haluamasi laite ei löydy Ulostulo-välilehdeltä, siirry Laitteisto-välilehdelle ja tarkista, että laitteesi löytyy luettelosta ja sen kohdalla lukee \"ulostulo\".", " Verkkotilien lisääminen liittää laajan valikoiman palveluja, kuten kalenterin, sähköpostin ja pikaviestimet, osaksi työpöydän käyttökokemusta. Tilejä lisäämällä eri verkkopalvelujen tapahtumia, kuten pikaviestejä, voi seurata samanaikaisesti. Kun tili on kerran luotu, kaikki tilit ja palvelut ovat käyttövalmiita heti tietokoneen käynnistyttyä."]